{"pageProps":{"post":{"title":"새로운 iOS 18 기능으로 iPhone 사용 방법이 혁신됩니다","description":"","date":"2024-05-20 17:45","slug":"2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone","content":"\n\n![image](/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_0.png)\n\n우리 모두가 알고 있는 대로, 애플은 항상 기술을 모든 사람들에게 접근 가능하게 만드는 선두에 서 있습니다.\n\n분명히 시청 또는 청각 장애를 가진 사람들이 아이폰으로 어떻게 삶이 더 편해진다고 칭찬하는 소셜 미디어 포스트나 비디오를 보았을 겁니다.\n\niOS 18에서는 아이폰이 그들의 삶을 더욱 쉽게 만든 새로운 접근성 기능이 많이 소개되었습니다. 이 기능들은 iOS 업데이트와 개발자 베타 버전 공식 발표 한 달 전에 도입되었습니다.\n\n<div class=\"content-ad\"></div>\n\n하지만 흥미로운 점은 이것들이 일반적인 접근성 기능이 아니라는 것입니다; iPhone에 추가된 몇 가지 멋진 기능은 청각이나 시각 장애를 가진 사람뿐만 아니라 모두에 의해 활용될 수 있습니다.\n\n눈으로 iPhone을 제어하거나, 좋아하는 노래의 비트를 진동을 통해 느끼거나, 자주 사용하는 앱을 사용자 정의 사운드로 실행하는 것에 대해 얘기하고 있습니다.\n\nTony Stark가 할 것 같은 소리가 날 수도 있지만, 이 모든 것이 iOS 18 업데이트의 일환으로 소개된 최신 기능으로 이루어져 있습니다.\n\n이 게시물에서는 Apple이 개발한 가장 흥미로운 새로운 접근성 기능에 대해 자세히 살펴보고, iPhone 경험을 더 직관적이고 개인화된, 재미있는 것으로 만드는 방법에 대해 알아볼 것입니다.\n\n<div class=\"content-ad\"></div>\n\n시작해봅시다!\n\n## 눈으로 iPhone을 제어하세요 (눈폰? 👀)\n\niOS 18은 iPhone과 상호 작용하는 방식을 바꿀 것이며, 업데이트의 일부로 제공되는 새로운 눈 추적 기능이 그 대표적인 예시입니다.\n\n이 기능은 신체적 장애를 가진 사람들을 고려하여 설계되었으며, 눈을 움직이는 것만으로 iPhone이나 iPad를 제어할 수 있습니다. 네, 정말 매우 놀라운 일이죠.\n\n<div class=\"content-ad\"></div>\n\n아래는 작동 방식입니다:\n\n해당 기능 자체는 미래 지향적이고 복잡해 보일 수 있지만, 실제로는 놀랍도록 간단합니다. 따라서 iPhone의 전면 카메라가 모션 추적을 수행하고 화면에서 동작으로 변환하는 모든 작업을 처리합니다.\n\n아마 iPhone의 카메라가 항상 켜져 있고 개인 정보에 대해 걱정하실 수 있겠지만 걱정하지 마세요. 이 모든 작업은 기기 내에서 이루어지므로 데이터가 누구와도 공유되지 않기 때문에 Apple을 포함한 누구에게도 개인 정보가 노출되는 우려가 없습니다.\n\n![iOS 18 새로운 기능으로 아이폰과 상호 작용하는 방식을 새롭게 정의](/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_1.png)\n\n<div class=\"content-ad\"></div>\n\n하지만, 흥미로운 점은 이 눈 추적 기능이 접근성에 관한 것뿐만 아니라 일상 업무에 손쉽게 활용할 수 있는 게임 체인저가 될 수 있다는 점입니다. 말 그대로, 당신은 팔을 올리지 않아도 잠재적으로 인스타그램 피드를 스크롤하거나, 이메일에 답장하거나, 비디오를 건너뛸 수도 있어요.\n\n가장 좋은 점은 추가 하드웨어 없이 iPadOS 및 iOS 앱 전체에서 매끄럽게 작동한다는 것입니다. 이는 카메라나 앱 스토어와 같은 시스템 앱부터 노트, 알림 및 캘린더와 같은 생산성 앱에 이르기까지 모든 것과 함께 사용할 수 있다는 것을 의미해요.\n\n<div class=\"content-ad\"></div>\n\niOS 18에서는 새로운 '음악 햅틱스' 기능이 소개됩니다. 아이폰의 알림을 위해 진동하는 기술이죠. 다만 이번에는 좋아하는 노래의 소리를 진동으로 번역해줄 거예요. 아이폰이 바지 주머니에 있을 때는 활성화하지 않도록 주의하세요. (물론, 그런 스타일이라면 활성화해도 좋지요!)\n\n이 기능의 가장 좋은 점은 일부 곡에만 제한되지 않는다는 것입니다. Apple은 음악 햅틱스가 Apple Music 카탈로그의 수백만 곡과 함께 작동하도록 설계되었다고 언급했습니다. 또한 Apple은 음악 햅틱스를 API로 제공할 예정이라고 밝혔는데, 곧 Spotify나 YouTube Music 같은 앱에서도 볼 수 있을 겁니다.\n\n저는 이 기능이 스트리밍 및 비디오 앱에 도입되어, 폭발이나 싸움 장면과 같은 장면에서 손에 멋진 진동 효과를 줄 수 있기를 희망합니다. 하지만 우선 너무 앞서서 생각해보지는 말아요. 이것이 배터리 수명에도 영향을 줄 것이라고 확신합니다.\n\n<div class=\"content-ad\"></div>\n\n하지만, 이 기능을 통해 음악을 새로운 차원에서 경험하고, 아마도 비디오까지도 즐길 수 있게 될 거예요. 아이폰에서 이 기능을 시도해 보고, 슬픈 노래를 들을 때 내 손과 내 마음에 미치는 효과를 느껴보고 싶네요.\n\n## 안녕 시리, 너 해고야\n\n세계 여러 사람들이 사용하는 iPhone의 기능인 음성 제어가 iOS 18 업데이트에서 크게 개선됩니다.\n\n실제로 음성 제어 기능에 추가되는 것은 두 가지입니다. 첫 번째는 보컬 단축키(Vocal Shortcuts)로, 기본 '애리시리' 깨우는 문구를 원하는 사용자 정의 문구로 바꿀 수 있게 해줍니다. (네, '자비스'로 바꿀 수 있어요)\n\n<div class=\"content-ad\"></div>\n\n이 새로운 업데이트를 통해 좋아하는 앱을 실행하거나 스마트 홈 장치를 제어하거나 Siri와 함께 하던 모든 작업을 더 자연스럽고 개인적인 명령어로 수행할 수 있게 될 거예요.\n\n신기한 기능이나 재미있는 파티 트릭 이상으로, 음성 단축키는 실제로 말능력에 어려움을 겪는 사람들에게 아이폰을 더 접근 가능하게 해줄 수 있어요. 업데이트에 추가된 두 번째 중요한 기능은 '이상 발화 감지'라는 동반 기능입니다.\n\n이 기능은 기기 내 기계 학습을 사용하여 다양한 발화 패턴에 자동적으로 적응하게 됩니다. 이는 척수성 마비나 ALS와 같은 질병을 앓는 사람들에게 큰 혜택이 될 거예요. 이들은 종종 Siri와 같은 전통적인 음성 비서에게 자신을 이해시키기 어려워 하지만, 솔직히 말하면 Siri는 기본적으로 누구든지 이해하는 데 어려움을 겪죠.\n\n<div class=\"content-ad\"></div>\n\n농담은 빼면서도, Apple이 개인 맞춤형 음성 인식으로 나아가는 것은 접근성에 대한 중요한 진전이며, 인공 지능이 기술을 모든 사람에게 포용적이고 사용자 친화적으로 만드는 방법의 좋은 예입니다.\n\n삼성과 구글과 같은 다른 대기업들이도 이에 합류하고 그러한 기능을 자사 기기에 구현하기를 희망합니다. 그저 가짜 달 사진 찍기나 흔히 알려진 이미지 생성과 같은 획기적인 기능뿐만 아니라 말이죠.\n\n## 멀미와 작별하기 🤢\n\n움직이는 차량 내에서 핸드폰을 사용하려고 할 때 거부감을 느낀 적이 없으면 부러워요. 이동 중에 핸드폰을 사용하려고 할 때 너무 불편한 느낌 중 하나일 것입니다. 여행할 때 가장 최악의 느낌 중 하나인데, 자주 지루하고, 토할 것 같은 욕구를 느낄 때 핸드폰을 사용할 수조차 없으니까요.\n\n<div class=\"content-ad\"></div>\n\niOS 18 업데이트에서 소개된 이 새로운 접근성 기능 '차량 동작 안내'에 대해 무척 기대되는 이유를 설명한 것입니다. 이미 제 개인적으로 가장 선호하는 기능이기도 한데요.\n\n이 기능이 어떻게 동작하는지 설명하기 전에 멀미가 어떻게 발생하는지 설명하겠습니다. 멀미는 주로 보는 것과 느끼는 것 사이의 불일치로 인해 발생합니다. 눈은 정적인 화면에 집중되어 있지만 몸은 움직임을 느끼기 때문에 메스꺼움이 발생할 수 있습니다.\n\niOS 18의 '차량 동작 안내' 기능은 iPhone 화면 가장자리에 애니메이션 점을 표시하여 이 간극을 메우고자 합니다. 이러한 점들은 자동차의 움직임과 동기화되게 약간 움직이며, 뇌에 시각적인 참조점을 제공하여 몸이 경험하는 것과 일치하는 것을 제공합니다.\n\n<div class=\"content-ad\"></div>\n\n그게 간단한 개념처럼 들릴 수 있지만 실제로 매우 효과적일 수 있어요. iPhone이나 iPad의 내장 센서를 사용하여, Vehicle Motion Cues는 자동으로 차량 이동 감지하고 그에 따라 활성화되는 기능이에요. 심지어 자동으로 켜지도록 설정할 수 있어서 여행할 때마다 그것에 대해 생각할 필요가 없어요.\n\n저에게는 iOS 18에서 가장 흥미로운 새로운 기능 중에서도 이것이 터무니없이 흥미로워요. 제 요구 사항에 딱 맞춰져 있는 것 같아서 기쁘고요. 이제 멀리 가는 차 안에서도 메스꺼움을 느끼지 않고 핸드폰을 사용할 수 있다는 게 너무 설레고요. 많은 사람들에게 영향을 미치는 문제에 대처하면서 창의적으로 생각해 주신 애플에게 감사드리고 싶어요. 이런 기능을 만들어낸 애플 직원은 아마도 멀미를 하지 않을까 싶어요.\n\n## 약간의 다른 작은 개선사항 ✨\n\n위에서 언급한 새롭고 흥미로운 기능 이외에도, iOS 18에는 iPhone에 미치는 큰 향상을 가져다주는 몇 가지 다른 작은 접근성 기능이 포함되어 있어서 많은 사람들이 그것을 감사히 받아들일 것이라고 확신해요.\n\n<div class=\"content-ad\"></div>\n\n보이스오버 사용자들은 새로운 목소리, 사용자 정의 가능한 음성 로터, 그리고 Mac에서 키보드 단축키를 맞춤 설정할 수 있는 기능과 함께 개인화와 제어를 더욱 즐길 수 있게 되었습니다.\n\n새로운 리더 모드를 제공하는 확대기 옵션을 통해 텍스트를 더욱 읽기 쉽게 만들 수 있으며, 감지 모드에 쉽게 접근하여 사용자들이 주변 환경을 더 편리하게 탐색할 수 있게 됩니다.\n\n<img src=\"/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_3.png\" />\n\n더불어, 라이브 스피치 사용자들은 새로운 카테고리와 라이브 캡션과의 원활한 통합을 통해 혜택을 받게 되며, 운동 기능 장애가 있는 사용자들을 위해 새롭고 개선된 가상 트랙패드가 아이폰을 탐색하는 편리한 방법을 제공합니다.\n\n<div class=\"content-ad\"></div>\n\n마침내, 보이스 컨트롤이 업그레이드되어 사용자 정의 어휘와 복잡한 단어를 더 잘 인식하여 더 많은 사람들에게 유용해졌습니다.\n\niOS 18 업데이트에서 도입되는 가장 멋진 기능과 가장 혁명적인 접근성 기능에 대해 저와 같이 흥분하고 계시길 바랍니다.\n\n물론, 우리가 보았듯이 이러한 기능은 장애를 가진 사람들만을 위한 것이 아닙니다. 이것들은 우리가 아이폰과 아이패드와 상호 작용하는 방식을 혁신할 수 있으며, 일상적인 작업을 더 쉽고 직관적으로, 아마 더 재미있게 만들 수 있습니다.\n\n차 안에서 전화를 받거나 사용할 때 멀미하지 않고 휴대폰을 사용할 수 있는 가능성에 개인적으로 열광하지만, 또한 다른 사람들이 이러한 기능을 활용하는 방법을 보는 것도 기대됩니다. 눈으로 전화를 제어하거나 음악을 손으로 느끼거나 사용자 정의 음성 명령을 만드는 것, iOS 18에는 우리 모두를 위한 것이 있습니다.\n\n<div class=\"content-ad\"></div>\n\n아래 댓글 섹션에서 어떤 기능을 제일 기대하고 시도해보고 싶은지 알려주세요! 만약 이러한 기능을 활용하는 새로운 방법을 발견하면 공유도 해주세요. 흥미로운 사용 사례를 발견하는 것을 기대할게요!\n\n만약 워크플로에 새로운 유용한 앱을 발견하고 추가하는 것을 좋아한다면, 맥과 아이폰 앱 스토어인 Setapp을 정말 좋아하실 것입니다. 이 앱 스토어는 200개 이상의 프리미엄 앱을 단일 월 구독료 9.99달러로 이용할 수 있습니다.\n\n아래 내 제휴 링크를 사용하여 Setapp을 30일간 무료로 이용해보세요! 'usefultech' 코드를 사용하여 혜택을 받으실 수 있습니다.\n\n아래 링크를 통해 Setapp의 200여 개 프리미엄 앱을 30일간 무료로 이용하고 동시에 제 블로그를 직접 지원해주세요!","ogImage":{"url":"/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_0.png"},"coverImage":"/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_0.png","tag":["Tech"],"readingTime":6},"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    img: \"img\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_0.png\",\n        alt: \"image\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"우리 모두가 알고 있는 대로, 애플은 항상 기술을 모든 사람들에게 접근 가능하게 만드는 선두에 서 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"분명히 시청 또는 청각 장애를 가진 사람들이 아이폰으로 어떻게 삶이 더 편해진다고 칭찬하는 소셜 미디어 포스트나 비디오를 보았을 겁니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"iOS 18에서는 아이폰이 그들의 삶을 더욱 쉽게 만든 새로운 접근성 기능이 많이 소개되었습니다. 이 기능들은 iOS 업데이트와 개발자 베타 버전 공식 발표 한 달 전에 도입되었습니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"하지만 흥미로운 점은 이것들이 일반적인 접근성 기능이 아니라는 것입니다; iPhone에 추가된 몇 가지 멋진 기능은 청각이나 시각 장애를 가진 사람뿐만 아니라 모두에 의해 활용될 수 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"눈으로 iPhone을 제어하거나, 좋아하는 노래의 비트를 진동을 통해 느끼거나, 자주 사용하는 앱을 사용자 정의 사운드로 실행하는 것에 대해 얘기하고 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Tony Stark가 할 것 같은 소리가 날 수도 있지만, 이 모든 것이 iOS 18 업데이트의 일환으로 소개된 최신 기능으로 이루어져 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이 게시물에서는 Apple이 개발한 가장 흥미로운 새로운 접근성 기능에 대해 자세히 살펴보고, iPhone 경험을 더 직관적이고 개인화된, 재미있는 것으로 만드는 방법에 대해 알아볼 것입니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"시작해봅시다!\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"눈으로 iPhone을 제어하세요 (눈폰? 👀)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"iOS 18은 iPhone과 상호 작용하는 방식을 바꿀 것이며, 업데이트의 일부로 제공되는 새로운 눈 추적 기능이 그 대표적인 예시입니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이 기능은 신체적 장애를 가진 사람들을 고려하여 설계되었으며, 눈을 움직이는 것만으로 iPhone이나 iPad를 제어할 수 있습니다. 네, 정말 매우 놀라운 일이죠.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"아래는 작동 방식입니다:\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"해당 기능 자체는 미래 지향적이고 복잡해 보일 수 있지만, 실제로는 놀랍도록 간단합니다. 따라서 iPhone의 전면 카메라가 모션 추적을 수행하고 화면에서 동작으로 변환하는 모든 작업을 처리합니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"아마 iPhone의 카메라가 항상 켜져 있고 개인 정보에 대해 걱정하실 수 있겠지만 걱정하지 마세요. 이 모든 작업은 기기 내에서 이루어지므로 데이터가 누구와도 공유되지 않기 때문에 Apple을 포함한 누구에게도 개인 정보가 노출되는 우려가 없습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_1.png\",\n        alt: \"iOS 18 새로운 기능으로 아이폰과 상호 작용하는 방식을 새롭게 정의\"\n      })\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"하지만, 흥미로운 점은 이 눈 추적 기능이 접근성에 관한 것뿐만 아니라 일상 업무에 손쉽게 활용할 수 있는 게임 체인저가 될 수 있다는 점입니다. 말 그대로, 당신은 팔을 올리지 않아도 잠재적으로 인스타그램 피드를 스크롤하거나, 이메일에 답장하거나, 비디오를 건너뛸 수도 있어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"가장 좋은 점은 추가 하드웨어 없이 iPadOS 및 iOS 앱 전체에서 매끄럽게 작동한다는 것입니다. 이는 카메라나 앱 스토어와 같은 시스템 앱부터 노트, 알림 및 캘린더와 같은 생산성 앱에 이르기까지 모든 것과 함께 사용할 수 있다는 것을 의미해요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"iOS 18에서는 새로운 '음악 햅틱스' 기능이 소개됩니다. 아이폰의 알림을 위해 진동하는 기술이죠. 다만 이번에는 좋아하는 노래의 소리를 진동으로 번역해줄 거예요. 아이폰이 바지 주머니에 있을 때는 활성화하지 않도록 주의하세요. (물론, 그런 스타일이라면 활성화해도 좋지요!)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이 기능의 가장 좋은 점은 일부 곡에만 제한되지 않는다는 것입니다. Apple은 음악 햅틱스가 Apple Music 카탈로그의 수백만 곡과 함께 작동하도록 설계되었다고 언급했습니다. 또한 Apple은 음악 햅틱스를 API로 제공할 예정이라고 밝혔는데, 곧 Spotify나 YouTube Music 같은 앱에서도 볼 수 있을 겁니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"저는 이 기능이 스트리밍 및 비디오 앱에 도입되어, 폭발이나 싸움 장면과 같은 장면에서 손에 멋진 진동 효과를 줄 수 있기를 희망합니다. 하지만 우선 너무 앞서서 생각해보지는 말아요. 이것이 배터리 수명에도 영향을 줄 것이라고 확신합니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"하지만, 이 기능을 통해 음악을 새로운 차원에서 경험하고, 아마도 비디오까지도 즐길 수 있게 될 거예요. 아이폰에서 이 기능을 시도해 보고, 슬픈 노래를 들을 때 내 손과 내 마음에 미치는 효과를 느껴보고 싶네요.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"안녕 시리, 너 해고야\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"세계 여러 사람들이 사용하는 iPhone의 기능인 음성 제어가 iOS 18 업데이트에서 크게 개선됩니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"실제로 음성 제어 기능에 추가되는 것은 두 가지입니다. 첫 번째는 보컬 단축키(Vocal Shortcuts)로, 기본 '애리시리' 깨우는 문구를 원하는 사용자 정의 문구로 바꿀 수 있게 해줍니다. (네, '자비스'로 바꿀 수 있어요)\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이 새로운 업데이트를 통해 좋아하는 앱을 실행하거나 스마트 홈 장치를 제어하거나 Siri와 함께 하던 모든 작업을 더 자연스럽고 개인적인 명령어로 수행할 수 있게 될 거예요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"신기한 기능이나 재미있는 파티 트릭 이상으로, 음성 단축키는 실제로 말능력에 어려움을 겪는 사람들에게 아이폰을 더 접근 가능하게 해줄 수 있어요. 업데이트에 추가된 두 번째 중요한 기능은 '이상 발화 감지'라는 동반 기능입니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이 기능은 기기 내 기계 학습을 사용하여 다양한 발화 패턴에 자동적으로 적응하게 됩니다. 이는 척수성 마비나 ALS와 같은 질병을 앓는 사람들에게 큰 혜택이 될 거예요. 이들은 종종 Siri와 같은 전통적인 음성 비서에게 자신을 이해시키기 어려워 하지만, 솔직히 말하면 Siri는 기본적으로 누구든지 이해하는 데 어려움을 겪죠.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"농담은 빼면서도, Apple이 개인 맞춤형 음성 인식으로 나아가는 것은 접근성에 대한 중요한 진전이며, 인공 지능이 기술을 모든 사람에게 포용적이고 사용자 친화적으로 만드는 방법의 좋은 예입니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"삼성과 구글과 같은 다른 대기업들이도 이에 합류하고 그러한 기능을 자사 기기에 구현하기를 희망합니다. 그저 가짜 달 사진 찍기나 흔히 알려진 이미지 생성과 같은 획기적인 기능뿐만 아니라 말이죠.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"멀미와 작별하기 🤢\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"움직이는 차량 내에서 핸드폰을 사용하려고 할 때 거부감을 느낀 적이 없으면 부러워요. 이동 중에 핸드폰을 사용하려고 할 때 너무 불편한 느낌 중 하나일 것입니다. 여행할 때 가장 최악의 느낌 중 하나인데, 자주 지루하고, 토할 것 같은 욕구를 느낄 때 핸드폰을 사용할 수조차 없으니까요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"iOS 18 업데이트에서 소개된 이 새로운 접근성 기능 '차량 동작 안내'에 대해 무척 기대되는 이유를 설명한 것입니다. 이미 제 개인적으로 가장 선호하는 기능이기도 한데요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이 기능이 어떻게 동작하는지 설명하기 전에 멀미가 어떻게 발생하는지 설명하겠습니다. 멀미는 주로 보는 것과 느끼는 것 사이의 불일치로 인해 발생합니다. 눈은 정적인 화면에 집중되어 있지만 몸은 움직임을 느끼기 때문에 메스꺼움이 발생할 수 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"iOS 18의 '차량 동작 안내' 기능은 iPhone 화면 가장자리에 애니메이션 점을 표시하여 이 간극을 메우고자 합니다. 이러한 점들은 자동차의 움직임과 동기화되게 약간 움직이며, 뇌에 시각적인 참조점을 제공하여 몸이 경험하는 것과 일치하는 것을 제공합니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"그게 간단한 개념처럼 들릴 수 있지만 실제로 매우 효과적일 수 있어요. iPhone이나 iPad의 내장 센서를 사용하여, Vehicle Motion Cues는 자동으로 차량 이동 감지하고 그에 따라 활성화되는 기능이에요. 심지어 자동으로 켜지도록 설정할 수 있어서 여행할 때마다 그것에 대해 생각할 필요가 없어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"저에게는 iOS 18에서 가장 흥미로운 새로운 기능 중에서도 이것이 터무니없이 흥미로워요. 제 요구 사항에 딱 맞춰져 있는 것 같아서 기쁘고요. 이제 멀리 가는 차 안에서도 메스꺼움을 느끼지 않고 핸드폰을 사용할 수 있다는 게 너무 설레고요. 많은 사람들에게 영향을 미치는 문제에 대처하면서 창의적으로 생각해 주신 애플에게 감사드리고 싶어요. 이런 기능을 만들어낸 애플 직원은 아마도 멀미를 하지 않을까 싶어요.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"약간의 다른 작은 개선사항 ✨\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"위에서 언급한 새롭고 흥미로운 기능 이외에도, iOS 18에는 iPhone에 미치는 큰 향상을 가져다주는 몇 가지 다른 작은 접근성 기능이 포함되어 있어서 많은 사람들이 그것을 감사히 받아들일 것이라고 확신해요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"보이스오버 사용자들은 새로운 목소리, 사용자 정의 가능한 음성 로터, 그리고 Mac에서 키보드 단축키를 맞춤 설정할 수 있는 기능과 함께 개인화와 제어를 더욱 즐길 수 있게 되었습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"새로운 리더 모드를 제공하는 확대기 옵션을 통해 텍스트를 더욱 읽기 쉽게 만들 수 있으며, 감지 모드에 쉽게 접근하여 사용자들이 주변 환경을 더 편리하게 탐색할 수 있게 됩니다.\"\n    }), \"\\n\", _jsx(\"img\", {\n      src: \"/assets/img/2024-05-20-NewiOS18FeaturesReimagineHowYouInteractWithYouriPhone_3.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"더불어, 라이브 스피치 사용자들은 새로운 카테고리와 라이브 캡션과의 원활한 통합을 통해 혜택을 받게 되며, 운동 기능 장애가 있는 사용자들을 위해 새롭고 개선된 가상 트랙패드가 아이폰을 탐색하는 편리한 방법을 제공합니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"마침내, 보이스 컨트롤이 업그레이드되어 사용자 정의 어휘와 복잡한 단어를 더 잘 인식하여 더 많은 사람들에게 유용해졌습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"iOS 18 업데이트에서 도입되는 가장 멋진 기능과 가장 혁명적인 접근성 기능에 대해 저와 같이 흥분하고 계시길 바랍니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"물론, 우리가 보았듯이 이러한 기능은 장애를 가진 사람들만을 위한 것이 아닙니다. 이것들은 우리가 아이폰과 아이패드와 상호 작용하는 방식을 혁신할 수 있으며, 일상적인 작업을 더 쉽고 직관적으로, 아마 더 재미있게 만들 수 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"차 안에서 전화를 받거나 사용할 때 멀미하지 않고 휴대폰을 사용할 수 있는 가능성에 개인적으로 열광하지만, 또한 다른 사람들이 이러한 기능을 활용하는 방법을 보는 것도 기대됩니다. 눈으로 전화를 제어하거나 음악을 손으로 느끼거나 사용자 정의 음성 명령을 만드는 것, iOS 18에는 우리 모두를 위한 것이 있습니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"아래 댓글 섹션에서 어떤 기능을 제일 기대하고 시도해보고 싶은지 알려주세요! 만약 이러한 기능을 활용하는 새로운 방법을 발견하면 공유도 해주세요. 흥미로운 사용 사례를 발견하는 것을 기대할게요!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"만약 워크플로에 새로운 유용한 앱을 발견하고 추가하는 것을 좋아한다면, 맥과 아이폰 앱 스토어인 Setapp을 정말 좋아하실 것입니다. 이 앱 스토어는 200개 이상의 프리미엄 앱을 단일 월 구독료 9.99달러로 이용할 수 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"아래 내 제휴 링크를 사용하여 Setapp을 30일간 무료로 이용해보세요! 'usefultech' 코드를 사용하여 혜택을 받으실 수 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"아래 링크를 통해 Setapp의 200여 개 프리미엄 앱을 30일간 무료로 이용하고 동시에 제 블로그를 직접 지원해주세요!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}},"__N_SSG":true}