{"pageProps":{"post":{"title":"할아버지는 은행을 믿지 않았다 이제, 디지털 뱅킹이 사람들에게 똑같은 감정을 일으킨다","description":"","date":"2024-05-18 20:57","slug":"2024-05-18-MyGrandfatherDidntTrustBanksNowDigitalBankingMakesPeopleFeeltheSameWay","content":"\n\n![image](/assets/img/2024-05-18-MyGrandfatherDidntTrustBanksNowDigitalBankingMakesPeopleFeeltheSameWay_0.png)\n\n본 이야기에는 금융 관련 조언이 포함되어 있지 않으며, 제휴 링크도 없습니다.\n\n저는 애플에서 여러 해 일하면서 애플 스토어에서도 근무했었고, 고객들이 장치를 어떻게 사용해야 하는지에 대해 매일 수십 개의 질문을 받았습니다. 심지어 수업도 가르쳤어요. 온라인 뱅킹에 대한 이야기가 많이 나왔는데, 시간이 지남에 따라 도움이 되는 몇 가지 제안을 알아가면서 공유하고 싶다고 생각했습니다. 할아버지 이야기부터 시작하겠지만, 이는 노인들에 관한 이야기가 아닙니다. 각 세대가 이 주제에 어려움을 겪는 모습을 직접 목격했습니다.\n\n## 할아버지는 옛 방식으로은 뱅킹을 했습니다.\n\n<div class=\"content-ad\"></div>\n\n은행에 간 적이 있던 유일한 경우는 월급을 현금화하기 위한 것이었습니다. 그는 그 돈을 모두 매트리스 아래에 넣어두었습니다. 청구해야 할 청구서가 있으면, 그는 사업장으로 가서 현금을 전달했습니다. 차를 포함한 물건을 살 때도 현금으로 지불했습니다. 돈이 없으면 사지 않았습니다.\n\n그는 한 가지 양보를 했는데, 바로 정부에 세금을 지불해야 할 때였습니다. 수표부도 없었기 때문에 돈 지급을 위해 서부연합에 가곤했습니다.\n\n부모님은 수표부와 은행 계좌를 가졌지만, 청구서를 지불하는 방식은 별 차이가 없었습니다. 은행 계좌가 있어서 숨길 돈은 없었지만, 그들 또한 여전히 모두에게 현금으로 지불하길 원했습니다. 어머니와 함께 은행에 가는 모습이 기억나는데, 거기서 현금으로 지불할 수표를 썼습니다. 그 때는 ATM이 없었습니다.\n\n오늘은 매우 달라졌습니다. 내 지갑에 현금이 있던 마지막 시간을 기억할 수가 없어요. 모두 카드나 앱을 사용하거나, 시장 앞에서 과자를 판매하는 걸스카우트조차도 그렇습니다.\n\n<div class=\"content-ad\"></div>\n\n현금을 사용하는 유일한 시간은 복권을 사는 드문 경우일 때뿐이에요. 복권 관계자들은 똑똑해요. 카드는 받지 않아요. 그 대신, 장보는 돈을 내고 현금을 받아오면, 바로 매장 앞의 복권 판매기로 가요.\n\n우리는 또한 온라인으로 청구서를 지불해요. 모두가 손쉽게 당신의 돈을 받을 수 있는 지불 포털을 갖고 있어요. 당신의 은행을 연결하고 몇 초 안에 지불하세요.\n\n내 할아버지가 느낀 대로 사람들은 아직 은행을 신뢰하지 않고, 무엇보다 디지털 뱅킹을 신뢰하지 않아요. 해킹, 사기, 신분 도용의 이야기를 듣고 나서 그런 부분에 대해서는 관련이 없다 생각해요. 그리고 온라인전용 은행의 증가가 상황을 해결하지 못하게 만들어요.\n\n일부 사람들은 수표와 현금이 여전히 물건을 지불하는 더 나은 방법이라고 믿어요. 그들이 틀렸다는 게 너무나 안타까운게요, 상황이 많이 바뀌었거든요.\n\n<div class=\"content-ad\"></div>\n\n## 아직 수표를 사용 중이라면 문제가 있을 수 있어요.\n\n이제 거의 모든 곳에서는 수표를 받지 않아요. 은행조차 수표 처리 비용이 더 많이 소요되기 때문에 가맹점들이 수표 수령을 자제하도록 권고하고 있어요. 은행들은 상인들이 카드를 받아들이도록 하기 위해 수표 수수료를 올리기도 했어요.\n\n수표는 여러분이 생각하는 것만큼 안전하지 않아요. 여러분의 수표는 해커가 계정을 털기 위해 필요한 모든 정보를 제공해요. 수표는 계정 번호, 은행 라우팅 번호, 이름, 주소를 나타내거든요. 주소가 없더라도 쉽게 온라인에서 찾을 수 있어요.\n\n수표장도 훔치면 일이 더 간단해져요. 모바일 뱅킹 앱을 통해 앞뒤를 촬영하여 수표를 입금할 수 있죠. 도용범이 여러분의 서명을 맞추지 못해도 문제가 되지 않아요. 도둑은 단지 돈을 다른 계정으로 넣어 출금할 수 있는 만큼만 잠시 보관하면 돼요.\n\n<div class=\"content-ad\"></div>\n\n나는 할아버지처럼 현금만 사용해서 벗어날 수 있을까 궁금했지만, 수표보다 문제가 더 많았어. 우리 모두는 할아버지가 돈을 숨겨 둔 곳을 잘 알고 있었으며, 몇 장을 몰래 꺼내도 괜찮겠지만, 그가 얼마나 많은 돈을 가졌는지 정확히 알지 못할까 두려워했어. 할아버지는 가끔씩 현금을 옮긴다고 주장했지만, 믿는 사람은 아무도 없었어.\n\n이건 결국 누군가가 그의 집에 침입하면 그를 금방 털 수 있다는 뜻이었어. 또한 그가 종종 주머니에 많은 양의 현금을 들고 다니며, 좋은 동네에 살지 않는다는 뜻이기도 했어.\n\n좋은 곳을 찾아 숨길 수도 있겠지만, 문제는 이런 게 있다: 강도들이 너를 속였다는 거야. 책 사이에 지폐를 넣는 건 아마추어 수준이야. 화장실 물조절기나 냉장고 안에 숨기는 것도 마찬가지야.\n\n대마초 흡연자들이 도와줄 수도 있을 거야. 그들은 가짜 비어 있는 캔, 병, 그리고 다른 가정용품을 사용해 자신의 판매품을 감췄다. \"비밀을 폭로했다\"고 나에게 화내지 말아 줘. 이건 도둑질 기초 수업이니까.\n\n<div class=\"content-ad\"></div>\n\n## 이제, 디지턈 뱅킹에 대해 이야기해 봐요.\n\n디지턈 뱅킹의 장점에 대해서 언급해 드릴까요? 편의성은 디지턈 뱅킹에서 큰 장점 중 하나에요. 예를 들어, 더 이상 지점에 방문하지 않아도 되며, ATM을 이용할 필요도 없어요.\n\n수표를 입금하거나 어디에서나 송금하는 것도 편해요. Venmo, Paypal, Zelle과 같은 앱을 통해 간편하게 송금할 수도 있어요. 이들을 이용해 도둑이 당신을 노릴 수 있다고 이야기했지만, 도와줄 수 있는 안전장치가 있어요.\n\n청구서를 예약할 수도 있어요. 만기일에 맞춰 청구서를 스케줄링하여 한 번에 모두 지불한 뒤 잊어버릴 수도 있어요. 자동 결제도 도와줄 거예요. 이제 무언가를 지불했는지 기억해야 하는 수고는 없어요.\n\n<div class=\"content-ad\"></div>\n\n많은 사람들이 월급을 직접 예금으로 받지만, 여러분은 자동으로 월급을 다른 계좌에 나눠 넣을 수 있다는 사실을 알고 계셨나요?\n\n디지털 뱅킹을 통해 금융 기관이 뭔가 잘못되었거나 의심스러운 점이 있을 경우 알려주고, 잔액을 신속하고 쉽게 확인하며 이체된 결제 내역을 확인할 수 있습니다.\n\n## 나는 디지턈 화폐에 대한 두 가지 주요 이유로 사람들이 거리낌을 느끼는 것을 알았어요: 보안과 복잡성.\n\n이전에 언급한 바와 같이, 이는 기술에 어려움을 겪는 노인들과 관련이 없습니다. 자녀들도 자신의 비밀번호를 기억하거나 이중 인증을 사용하려는 점에서 탁월하지 않습니다. 젊은 사람들이 기술에 둘러싸여 자라고 있기 때문에 이점이 있다고 해서 유리한 것은 아닙니다고 진술했어요. 그들도 결국 여러분과 마찬가지로 소비자일 뿐이에요.\n\n<div class=\"content-ad\"></div>\n\n당신의 신원이 도용되는 건 대개 당신이 실수를 한 결과입니다. 아마도 자기가 너무 기술에 능숙하다고 생각해서 사기에 속지 않을 거라 생각할 수도 있지만, 돈을 훔치는 방법들은 점점 더 정교해지고 있는 중이에요. 전 세계적인 거대 기업의 부사장인 친구가 있었는데, 최근에 6,000달러를 잃었던 사기 사건을 해결하는 데 도와줬어요. 그의 문제는 뭘까요? 약한 암호였어요.\n\n그는 혼자가 아니에요. 보안 소프트웨어 업체인 노튼에 따르면 확인된 침입 중 80% 이상이 약한 암호 때문에 발생했습니다. 노튼은 또한 사고 후 60%의 사람들이 암호를 강화하는 대신 처음부터 견고하게 만들지 않았다고 말하고 있어요.\n\n저는 애플 스토어에서 아이폰 설정을 돕기도 했죠. 비록 비추한 것이라고 제안했음에도, 많은 사람들이 6자리 대신 네 자리 숫자로 폰을 잠금해 해제하려 선택하고는 1234나 1111과 같은 암호를 사용했어요. 그 후 폰이 그 암호가 진정으로 원하는 암호인지 묻는데, \"쉽게 알아맞힐 수 있다\"고 알려줬지만 여전히 모두가 \"예\"를 눌렀어요.\n\n여러 사이트에서 동일한 암호를 재사용하나요? 노튼에 따르면 암호를 재사용하는 사람들 때문에 사고가 발생한다고 하네요. 이 통계는 우리 중 91%가 암호를 재사용하는 것은 보안 위험이라는 걸 알고 있다는 점에서 두드러지네요!\n\n<div class=\"content-ad\"></div>\n\n애완동물의 이름이나 생일을 비밀번호로 사용하는 것도 좋지 않은 생각이에요. 이것 역시 사기꾼들에게는 너무 쉬운 방법이죠.\n\n생활 속에서 기억해야 할 것들이 많고, 다른 것들을 쉽게 기억하는데 왜 비밀번호 하나가 어려울까요? 아마도 \"잠깐만요. 비밀번호가 몇 개, 아니면 수백 개일지도 몰라!\"라고 말하실지도 모르겠네요.\n\n여기에서 1Password나 LastPass 같은 비밀번호 관리자가 필요합니다. 각 사이트마다 복잡한 비밀번호를 만들고, 앱이 그걸 대신 기억해줍니다. 앱을 열려면 하나의 비밀번호만 기억하면 되죠. 이것이 누군가가 찾을 수 있도록 패스워드를 책에 적거나 이전 패스워드를 섞어 써 놓은 종이 조각에 메모하는 것보다 훨씬 나아요.\n\n비밀번호 관리자가 없더라도 기기들이 비밀번호를 저장할 것인지 묻는 경우가 있을 거에요. 이는 괜찮은 일이에요. 왜냐하면 로그인 정보가 강력하고, 이중 요소 인증을 사용하고 있으니까 말이죠? 제가 디지털 자산을 보호하는 실용적인 방법들을 마지막에 다룰게요.\n\n<div class=\"content-ad\"></div>\n\n## 이제, 복잡성에 대해 이야기해 봅시다.\n\n이미 디지턈 생활의 가장 어려운 부분인 비밀번호에 대해 다뤘어요. 다른 어려운 부분은 모든 것을 사용하는 법을 배우는 것이에요. 휴대폰을 해제하면 어디에나 버튼이 많아서 당황스러울 수 있어요. 이런 현상은 당신이 그 모든 버튼이 하는 일을 알아야 한다고 생각하기 때문에 발생합니다.\n\n하지만 사실은, 알 필요가 없어요. 예를 들어보죠. 집 주변에 리모컨이 많이 떨어져 있을 것 같아요. 하나 들어서 보고, 그 모든 버튼을 다 알고 있는지 스스로 물어보세요. 제안해 보는데, 여러분은 알지 못할 것이라고 확신해요. 이것이 제가 말하려는 바에요. 당신은 자신이 좋아하는 쇼를 보는 데 충분한 지식만 알고 있으면 돼요.\n\n앱과 기기도 마찬가지에요. 중요한 일을 해내기 위한 충분한 지식만 알면 돼요. 나이가 무엇이든지, 새로운 일을 배우고 있는데, 그럼 왜 휴대폰 앱을 배우는 것이 다른 거라 생각하는 건지요?\n\n<div class=\"content-ad\"></div>\n\n## 결론: 스스로를 보호할 수 있는 방법은 많이 있습니다.\n\n몇 달마다 비밀번호를 변경하십시오. 이중 인증을 활성화하십시오. 이것은 코드가 확인을 위해 다른 장치 중 하나로 보내지는 곳입니다. 알아요, 알아요, 로그인하려면 장치가 서로 가까이 있어야 하는 것이 귀찮은 일이지만, 자신의 돈을 아껴보세요.\n\n계정에 활동이 있을 때 이메일, 문자 및 푸시 알림을 설정하여 알림을 받으세요. 전화로 누군가에게 은행 정보를 제공하지 마십시오. 아무도 그 정보가 필요하지 않습니다. 누군가가 카드 번호를 확인하라고 요청하면, 그들이 보유한 것을 읽어보고 일치하는지 확인하라고 요청하십시오.\n\n금액이나 빚을 기프트 카드로 지불하지 마십시오. 예를 들어, IRS가 왜 기프트 카드로 지불하길 원할까요? 안타깝게도 이에 속은 친구가 있습니다. 애플 스토어에서 우리는 사기당하는 사람들을 돕기위해 기프트 카드가 어떻게 사용될지 물어보는 교육을 받았습니다.\n\n<div class=\"content-ad\"></div>\n\n공항, 커피숍, 도서관 및 호텔에서 사용할 때 공공 와이파이를 사용해서는 절대 은행 업무를 하거나 물건을 구매하지 마세요. 이메일이나 문자 메시지에서 은행 링크를 클릭하거나 전화번호를 걸지 마세요.\n\n요즘은 돈을 다루는 방식에는 긍정적인 면과 부정적인 면이 있습니다. 이러한 방식을 조합하는 방법이 분명히 있습니다. 중요한 것은 어떻게 작동하는지 알지 않고 어떤 방식을 무시하지 않는 것입니다. 제게는 정보에 기반한 결정을 내리는 것이 목표입니다.","ogImage":{"url":"/assets/img/2024-05-18-MyGrandfatherDidntTrustBanksNowDigitalBankingMakesPeopleFeeltheSameWay_0.png"},"coverImage":"/assets/img/2024-05-18-MyGrandfatherDidntTrustBanksNowDigitalBankingMakesPeopleFeeltheSameWay_0.png","tag":["Tech"],"readingTime":6},"content":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    img: \"img\",\n    h2: \"h2\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: _jsx(_components.img, {\n        src: \"/assets/img/2024-05-18-MyGrandfatherDidntTrustBanksNowDigitalBankingMakesPeopleFeeltheSameWay_0.png\",\n        alt: \"image\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"본 이야기에는 금융 관련 조언이 포함되어 있지 않으며, 제휴 링크도 없습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"저는 애플에서 여러 해 일하면서 애플 스토어에서도 근무했었고, 고객들이 장치를 어떻게 사용해야 하는지에 대해 매일 수십 개의 질문을 받았습니다. 심지어 수업도 가르쳤어요. 온라인 뱅킹에 대한 이야기가 많이 나왔는데, 시간이 지남에 따라 도움이 되는 몇 가지 제안을 알아가면서 공유하고 싶다고 생각했습니다. 할아버지 이야기부터 시작하겠지만, 이는 노인들에 관한 이야기가 아닙니다. 각 세대가 이 주제에 어려움을 겪는 모습을 직접 목격했습니다.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"할아버지는 옛 방식으로은 뱅킹을 했습니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"은행에 간 적이 있던 유일한 경우는 월급을 현금화하기 위한 것이었습니다. 그는 그 돈을 모두 매트리스 아래에 넣어두었습니다. 청구해야 할 청구서가 있으면, 그는 사업장으로 가서 현금을 전달했습니다. 차를 포함한 물건을 살 때도 현금으로 지불했습니다. 돈이 없으면 사지 않았습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"그는 한 가지 양보를 했는데, 바로 정부에 세금을 지불해야 할 때였습니다. 수표부도 없었기 때문에 돈 지급을 위해 서부연합에 가곤했습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"부모님은 수표부와 은행 계좌를 가졌지만, 청구서를 지불하는 방식은 별 차이가 없었습니다. 은행 계좌가 있어서 숨길 돈은 없었지만, 그들 또한 여전히 모두에게 현금으로 지불하길 원했습니다. 어머니와 함께 은행에 가는 모습이 기억나는데, 거기서 현금으로 지불할 수표를 썼습니다. 그 때는 ATM이 없었습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"오늘은 매우 달라졌습니다. 내 지갑에 현금이 있던 마지막 시간을 기억할 수가 없어요. 모두 카드나 앱을 사용하거나, 시장 앞에서 과자를 판매하는 걸스카우트조차도 그렇습니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"현금을 사용하는 유일한 시간은 복권을 사는 드문 경우일 때뿐이에요. 복권 관계자들은 똑똑해요. 카드는 받지 않아요. 그 대신, 장보는 돈을 내고 현금을 받아오면, 바로 매장 앞의 복권 판매기로 가요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"우리는 또한 온라인으로 청구서를 지불해요. 모두가 손쉽게 당신의 돈을 받을 수 있는 지불 포털을 갖고 있어요. 당신의 은행을 연결하고 몇 초 안에 지불하세요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"내 할아버지가 느낀 대로 사람들은 아직 은행을 신뢰하지 않고, 무엇보다 디지털 뱅킹을 신뢰하지 않아요. 해킹, 사기, 신분 도용의 이야기를 듣고 나서 그런 부분에 대해서는 관련이 없다 생각해요. 그리고 온라인전용 은행의 증가가 상황을 해결하지 못하게 만들어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"일부 사람들은 수표와 현금이 여전히 물건을 지불하는 더 나은 방법이라고 믿어요. 그들이 틀렸다는 게 너무나 안타까운게요, 상황이 많이 바뀌었거든요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"아직 수표를 사용 중이라면 문제가 있을 수 있어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이제 거의 모든 곳에서는 수표를 받지 않아요. 은행조차 수표 처리 비용이 더 많이 소요되기 때문에 가맹점들이 수표 수령을 자제하도록 권고하고 있어요. 은행들은 상인들이 카드를 받아들이도록 하기 위해 수표 수수료를 올리기도 했어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"수표는 여러분이 생각하는 것만큼 안전하지 않아요. 여러분의 수표는 해커가 계정을 털기 위해 필요한 모든 정보를 제공해요. 수표는 계정 번호, 은행 라우팅 번호, 이름, 주소를 나타내거든요. 주소가 없더라도 쉽게 온라인에서 찾을 수 있어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"수표장도 훔치면 일이 더 간단해져요. 모바일 뱅킹 앱을 통해 앞뒤를 촬영하여 수표를 입금할 수 있죠. 도용범이 여러분의 서명을 맞추지 못해도 문제가 되지 않아요. 도둑은 단지 돈을 다른 계정으로 넣어 출금할 수 있는 만큼만 잠시 보관하면 돼요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"나는 할아버지처럼 현금만 사용해서 벗어날 수 있을까 궁금했지만, 수표보다 문제가 더 많았어. 우리 모두는 할아버지가 돈을 숨겨 둔 곳을 잘 알고 있었으며, 몇 장을 몰래 꺼내도 괜찮겠지만, 그가 얼마나 많은 돈을 가졌는지 정확히 알지 못할까 두려워했어. 할아버지는 가끔씩 현금을 옮긴다고 주장했지만, 믿는 사람은 아무도 없었어.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이건 결국 누군가가 그의 집에 침입하면 그를 금방 털 수 있다는 뜻이었어. 또한 그가 종종 주머니에 많은 양의 현금을 들고 다니며, 좋은 동네에 살지 않는다는 뜻이기도 했어.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"좋은 곳을 찾아 숨길 수도 있겠지만, 문제는 이런 게 있다: 강도들이 너를 속였다는 거야. 책 사이에 지폐를 넣는 건 아마추어 수준이야. 화장실 물조절기나 냉장고 안에 숨기는 것도 마찬가지야.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"대마초 흡연자들이 도와줄 수도 있을 거야. 그들은 가짜 비어 있는 캔, 병, 그리고 다른 가정용품을 사용해 자신의 판매품을 감췄다. \\\"비밀을 폭로했다\\\"고 나에게 화내지 말아 줘. 이건 도둑질 기초 수업이니까.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"이제, 디지턈 뱅킹에 대해 이야기해 봐요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"디지턈 뱅킹의 장점에 대해서 언급해 드릴까요? 편의성은 디지턈 뱅킹에서 큰 장점 중 하나에요. 예를 들어, 더 이상 지점에 방문하지 않아도 되며, ATM을 이용할 필요도 없어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"수표를 입금하거나 어디에서나 송금하는 것도 편해요. Venmo, Paypal, Zelle과 같은 앱을 통해 간편하게 송금할 수도 있어요. 이들을 이용해 도둑이 당신을 노릴 수 있다고 이야기했지만, 도와줄 수 있는 안전장치가 있어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"청구서를 예약할 수도 있어요. 만기일에 맞춰 청구서를 스케줄링하여 한 번에 모두 지불한 뒤 잊어버릴 수도 있어요. 자동 결제도 도와줄 거예요. 이제 무언가를 지불했는지 기억해야 하는 수고는 없어요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"많은 사람들이 월급을 직접 예금으로 받지만, 여러분은 자동으로 월급을 다른 계좌에 나눠 넣을 수 있다는 사실을 알고 계셨나요?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"디지털 뱅킹을 통해 금융 기관이 뭔가 잘못되었거나 의심스러운 점이 있을 경우 알려주고, 잔액을 신속하고 쉽게 확인하며 이체된 결제 내역을 확인할 수 있습니다.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"나는 디지턈 화폐에 대한 두 가지 주요 이유로 사람들이 거리낌을 느끼는 것을 알았어요: 보안과 복잡성.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이전에 언급한 바와 같이, 이는 기술에 어려움을 겪는 노인들과 관련이 없습니다. 자녀들도 자신의 비밀번호를 기억하거나 이중 인증을 사용하려는 점에서 탁월하지 않습니다. 젊은 사람들이 기술에 둘러싸여 자라고 있기 때문에 이점이 있다고 해서 유리한 것은 아닙니다고 진술했어요. 그들도 결국 여러분과 마찬가지로 소비자일 뿐이에요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"당신의 신원이 도용되는 건 대개 당신이 실수를 한 결과입니다. 아마도 자기가 너무 기술에 능숙하다고 생각해서 사기에 속지 않을 거라 생각할 수도 있지만, 돈을 훔치는 방법들은 점점 더 정교해지고 있는 중이에요. 전 세계적인 거대 기업의 부사장인 친구가 있었는데, 최근에 6,000달러를 잃었던 사기 사건을 해결하는 데 도와줬어요. 그의 문제는 뭘까요? 약한 암호였어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"그는 혼자가 아니에요. 보안 소프트웨어 업체인 노튼에 따르면 확인된 침입 중 80% 이상이 약한 암호 때문에 발생했습니다. 노튼은 또한 사고 후 60%의 사람들이 암호를 강화하는 대신 처음부터 견고하게 만들지 않았다고 말하고 있어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"저는 애플 스토어에서 아이폰 설정을 돕기도 했죠. 비록 비추한 것이라고 제안했음에도, 많은 사람들이 6자리 대신 네 자리 숫자로 폰을 잠금해 해제하려 선택하고는 1234나 1111과 같은 암호를 사용했어요. 그 후 폰이 그 암호가 진정으로 원하는 암호인지 묻는데, \\\"쉽게 알아맞힐 수 있다\\\"고 알려줬지만 여전히 모두가 \\\"예\\\"를 눌렀어요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"여러 사이트에서 동일한 암호를 재사용하나요? 노튼에 따르면 암호를 재사용하는 사람들 때문에 사고가 발생한다고 하네요. 이 통계는 우리 중 91%가 암호를 재사용하는 것은 보안 위험이라는 걸 알고 있다는 점에서 두드러지네요!\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"애완동물의 이름이나 생일을 비밀번호로 사용하는 것도 좋지 않은 생각이에요. 이것 역시 사기꾼들에게는 너무 쉬운 방법이죠.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"생활 속에서 기억해야 할 것들이 많고, 다른 것들을 쉽게 기억하는데 왜 비밀번호 하나가 어려울까요? 아마도 \\\"잠깐만요. 비밀번호가 몇 개, 아니면 수백 개일지도 몰라!\\\"라고 말하실지도 모르겠네요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"여기에서 1Password나 LastPass 같은 비밀번호 관리자가 필요합니다. 각 사이트마다 복잡한 비밀번호를 만들고, 앱이 그걸 대신 기억해줍니다. 앱을 열려면 하나의 비밀번호만 기억하면 되죠. 이것이 누군가가 찾을 수 있도록 패스워드를 책에 적거나 이전 패스워드를 섞어 써 놓은 종이 조각에 메모하는 것보다 훨씬 나아요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"비밀번호 관리자가 없더라도 기기들이 비밀번호를 저장할 것인지 묻는 경우가 있을 거에요. 이는 괜찮은 일이에요. 왜냐하면 로그인 정보가 강력하고, 이중 요소 인증을 사용하고 있으니까 말이죠? 제가 디지털 자산을 보호하는 실용적인 방법들을 마지막에 다룰게요.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"이제, 복잡성에 대해 이야기해 봅시다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"이미 디지턈 생활의 가장 어려운 부분인 비밀번호에 대해 다뤘어요. 다른 어려운 부분은 모든 것을 사용하는 법을 배우는 것이에요. 휴대폰을 해제하면 어디에나 버튼이 많아서 당황스러울 수 있어요. 이런 현상은 당신이 그 모든 버튼이 하는 일을 알아야 한다고 생각하기 때문에 발생합니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"하지만 사실은, 알 필요가 없어요. 예를 들어보죠. 집 주변에 리모컨이 많이 떨어져 있을 것 같아요. 하나 들어서 보고, 그 모든 버튼을 다 알고 있는지 스스로 물어보세요. 제안해 보는데, 여러분은 알지 못할 것이라고 확신해요. 이것이 제가 말하려는 바에요. 당신은 자신이 좋아하는 쇼를 보는 데 충분한 지식만 알고 있으면 돼요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"앱과 기기도 마찬가지에요. 중요한 일을 해내기 위한 충분한 지식만 알면 돼요. 나이가 무엇이든지, 새로운 일을 배우고 있는데, 그럼 왜 휴대폰 앱을 배우는 것이 다른 거라 생각하는 건지요?\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"결론: 스스로를 보호할 수 있는 방법은 많이 있습니다.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"몇 달마다 비밀번호를 변경하십시오. 이중 인증을 활성화하십시오. 이것은 코드가 확인을 위해 다른 장치 중 하나로 보내지는 곳입니다. 알아요, 알아요, 로그인하려면 장치가 서로 가까이 있어야 하는 것이 귀찮은 일이지만, 자신의 돈을 아껴보세요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"계정에 활동이 있을 때 이메일, 문자 및 푸시 알림을 설정하여 알림을 받으세요. 전화로 누군가에게 은행 정보를 제공하지 마십시오. 아무도 그 정보가 필요하지 않습니다. 누군가가 카드 번호를 확인하라고 요청하면, 그들이 보유한 것을 읽어보고 일치하는지 확인하라고 요청하십시오.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"금액이나 빚을 기프트 카드로 지불하지 마십시오. 예를 들어, IRS가 왜 기프트 카드로 지불하길 원할까요? 안타깝게도 이에 속은 친구가 있습니다. 애플 스토어에서 우리는 사기당하는 사람들을 돕기위해 기프트 카드가 어떻게 사용될지 물어보는 교육을 받았습니다.\"\n    }), \"\\n\", _jsx(\"div\", {\n      class: \"content-ad\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"공항, 커피숍, 도서관 및 호텔에서 사용할 때 공공 와이파이를 사용해서는 절대 은행 업무를 하거나 물건을 구매하지 마세요. 이메일이나 문자 메시지에서 은행 링크를 클릭하거나 전화번호를 걸지 마세요.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"요즘은 돈을 다루는 방식에는 긍정적인 면과 부정적인 면이 있습니다. 이러한 방식을 조합하는 방법이 분명히 있습니다. 중요한 것은 어떻게 작동하는지 알지 않고 어떤 방식을 무시하지 않는 것입니다. 제게는 정보에 기반한 결정을 내리는 것이 목표입니다.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","frontmatter":{},"scope":{}}},"__N_SSG":true}