{"pageProps":{"post":{"title":"틱톡의 개인정보 처리 방침 당신의 디지턈 일기에 몰래 엿보기","description":"","date":"2024-05-20 21:30","slug":"2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary","content":"\n최근 몇 년간 소셜 미디어는 디지털 호기심에서 수십억 명의 사람들에게 일상의 중심이 된 기초 요소로 발전해 왔습니다. Facebook, Instagram, X (이전 트위터), TikTok과 같은 플랫폼들은 의사 소통, 엔터테인먼트, 교육 (가끔), 심지어 비즈니스를 위한 주요 채널들로 성장했습니다. 이 인기 폭발적인 상승은 플랫폼이 작동하는 방식을 이해하는 것의 중요성을 보여줍니다. 특히 이용 약관과 개인정보 보호 정책에 관련하여 이해하는 것이 중요합니다.\n\n이해하는 것이 왜 중요한지 궁금하신가요? 먼저, 이용 약관은 사용자로서 당신에게 기대되는 것과 플랫폼에서 기대할 수 있는 것을 개요로 제시합니다. 더 중요한 것은 개인정보 보호 정책이 당신의 개인 정보가 어떻게 수집되고 사용되며 보호되는지를 알려줍니다. 개인 정보 보호, 보안, 데이터 누출 및 남용에 대한 우려가 커짐에 따라, 이러한 정책의 내부 사항을 알고 있다면 온라인에서 공유할 정보 및 그 정보가 사용될 수 있는 방식에 대한 균형 잡힌 결정을 내릴 수 있습니다.\n\n예를 들어, 개인 정보 보호 정책을 통해 소셜 미디어 플랫폼이 당신의 정보를 제3자에게 판매하거나 광고를 타겟하여 사용하는지, 또는 브라우징 습관에 대한 정보를 수집하는지 등을 확인할 수 있습니다. 이러한 세부 사항을 알고 있다면 프로필 설정을 조정하거나 게시물을 더 신중하게 선택하거나 어떤 플랫폼을 사용할 가치가 있는지를 결정하는 데 도움이 될 수 있습니다.\n\n대규모 사용자 기반과 영향력을 감안할 때, TikTok의 개인 정보 보호 정책을 사례 연구로 살펴보기로 결정했습니다. 우리의 목표는 데이터 수집 관행부터 동의 및 데이터 공유 정책까지 사용자들이 알아야 할 통찰을 발굴하고 강조하는 것입니다. 제 목표는 독자들이 플랫폼에서 안전하고 자신감 있게 활동할 수 있는 지식을 제공하는 데 있습니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n![이미지](/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_0.png)\n\n# 전채\n\n이것은 틱톡의 개인 정보 보호 정책입니다 (최종 업데이트 2024년 1월 24일) - 틱톡이 여러분이 해당 앱, 웹사이트, 소프트웨어 또는 틱톡과 연결된 어떤 서비스를 사용할 때 어떻게 여러분의 개인 정보를 처리하는지 설명하는 규정서입니다. 사용하는 기기에 상관없이 적용됩니다.\n\n## 이 정책은 누구에게 적용되나요?\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n이 정책은 TikTok을 사용하는 누구에게나 13세 이상을 대상으로 합니다. 13세 미만인 경우에는 어린이 개인정보 보호 정책이 따로 있습니다.\n\n## TikTok은 우리에 대해 어떤 정보를 수집할까요?\n\nTikTok은 다음과 같은 정보를 수집할 수 있습니다:\n\n- 제공하는 정보. 이는 앱 또는 웹사이트에 입력한 모든 것을 포함합니다. 예를 들어 이름, 이메일 또는 게시물 등이 있습니다.\n- 다른 사람으로부터 수집한 정보. 가끔, TikTok은 다른 사용자나 제3자 서비스와 같은 다른 곳에서 여러분에 대한 정보를 얻을 수 있습니다.\n- 자동으로 수집된 정보. TikTok은 여러분이 수동으로 입력하지 않아도 앱의 사용 방식이나 위치와 같은 여러분에 대한 일부 정보를 자동으로 수집할 수 있습니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n# 당신이 제공한 정보\n\n틱톡 가입하려고 하는 거야? 준비해; 그렇다면 다음 정보를 공유할 수도 있어:\n\n- 기본 정보. 무심결에 시작되지만 — 이름, 나이, 사용자 이름, 비밀번호 — 예상한 것들이야. 하지만 그 후로, 이메일, 전화번호, 소셜 미디어 계정 정보를 요구할 거야. 아, 그리고 프로필 사진도 요구할 거야. 디지털 사람들 속에서 어떻게 당신을 알아볼까요?\n- 당신의 창작물. 자발적인 춤 비디오나 고양이의 캔디드 샷? 틱톡은 이것들을 모두 저장할 거야. 그리고 언제, 어디서, 그리고 어떤 필터들을 사용했는지 모조리 기억할 거야. 틱톡 사용자가 아니지만 친구의 비디오에 나왔다면? 놀랍지만, 당신도 콜렉션의 일부로 간주돼.\n- 채팅 내역. 보낸 모든 메시지? 틱톡은 이것들을 전달하는 것뿐만 아니라, 마을 소문처럼 정보들을 상세히 저장할 거야.\n- 클립보드 확인. 매운 미미나 민감한 비밀번호를 복사했냐고? 만약 틱톡을 사용 중이라면, 그것도 엿볼 수 있어.\n- 쇼핑 스토커. 틱톡 상품을 사게 됐을 때? 영수증은 그들이 갖고 있어, 말 그대로. 당신의 신용 카드 정보부터 집 주소까지, 모두 기록되어 있어.\n- 연락처 조사. 연락처를 통해 친구를 찾기로 했다고요? 틱톡은 그들만의 전화번호부처럼 당신의 전화 정보를 조사하며, 이름, 전화번호, 소셜 프로필 등 모두 훔칠 거야.\n- 본인 확인. 계정을 확인해야 한다면? 신분증을 선보일 시간이야.\n- 설문 조사. 설문이나 대회에 참여하게 되면, 그저 이기기 위한 기회뿐만 아니라 개인 정보를 더 많이 제공해야 해요. 당신의 성별, 나이부터 취미까지, 틱톡은 당신에 대한 프로필을 상세히 작성할 거야. 이것이 당신의 이력서보다도 상세할지도 몰라.\n\n틱톡에서 한 번의 탭, 입력, 셀카도 당신에 대해 수집하는 방대한 정보의 한 부분이 되어. 그들은 모든 것을 당신의 경험을 개선하기 위한 것이라고 약속하지만, 정말로 개인화된 것과 침입적인 것의 경계는 어디에 있는지 궁금해질 수밖에 없어. 틱톡의 데이터 제국의 광대한 체계 속에서, 우리는 사용자인가 혹은 사용되는 쪽일까?\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n![2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_1.png](/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_1.png)\n\n# 다른 소스로부터의 정보\n\n틱톡은 당신이 자발적으로 그들의 앱에 놓친 것만으로 만족하지 않습니다; 그들은 당신에 대한 데이터를 어디에서든 끌어모읍니다. 마치 당신의 디지턈 DNA를 한 줄씩 조립하는 것처럼, 그리고 그들이 그렇게 하는 방법은 다음과 같습니다:\n\n- 사이드 도어를 통해. 소셜 미디어 및 다른 로그인. 편한 로그인 옵션으로 Facebook, Google 또는 Instagram을 선택했나요? 축하합니다, 당신은 방금 틱톡에 당신의 공개 프로필, 이메일 및 연락처에 대한 황금열쇠를 건넸습니다. 안전하게 보관되어 있는 것으로 여겼던 조각 정보조차 이제는 틱톡에 공개되었습니다. 갑작스럽게 당신의 별개의 온라인 생활이 더 이상 분리되어 보이지 않네요.\n- 첩자들. 광고업자들과 협력사들. 그들은 틱톡에 정보를 푸널링하는 파트너 네트워크를 보유하고 있습니다. 다른 사이트에서 클릭한 스니커즈 광고? 틱톡은 앎니다. 앱에서 한 밤의 쇼핑 열풍이 있었나요? 틱톡은 영수증을 보유하고 있습니다. 마치 당신이 한 디지턈 움직임을 카탈로그로 만들어 돌아오는 그림자가 있는 것처럼서입니다.\n- 가족관계. 계열회사들. 틱톡의 거대한 회사 그룹이 당신에 대해 알고 있다면, 그 데이터는 틱톡이 알고 있을 것입니다. 관련 앱이나 서비스를 사용했나요? 그 데이터는 틱톡으로 이동할 수 있어서 그 서버에서 당신의 프로필을 더 확실하게 만들 것입니다.\n- 입소문. 다른 사람들로부터의 정보. 비디오에서 언급된 적이 있거나 누군가가 당신의 연락처 정보를 틱톡과 공유한 적이 있나요? 그것은 허락을 받지 않아도 당신의 프로필에 추가되는 또 다른 퍼즐 조각입니다.\n- 정찰단. 외부 소스들. 틱톡의 촉수는 더 나아가서 공공 기록, 전문가 그룹 및 어디에서 어디까지든 데이터를 끌어모읍니다. 당신의 개인정보 설정이 얼마나 엄격하든 상관없습니다; 있다면, 틱톡이 그것을 캐내다가 있을 수 있습니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n모든 이는 TikTok이 그들의 플랫폼에서 하는 일만을 주시하는 것이 아니라, 당신의 디지털 생활을 전반적으로 보고 있다는 것을 의미합니다. 맞춤형 콘텐츠와 광고는 멋진 트릭처럼 보일 수 있지만, 이들은 당신의 개인 정보를 희생하게 만들어 자세한 프로필로 이어지며, 디지턈 라인업에서 당신을 대신할 수도 있을 만큼 세밀합니다. TikTok은 이 모든 것이 더 나은 사용자 경험을 위한 것이라고 확신시켜 주지만, 우리가 언제 이렇게 철저하게 알려지기로 동의했는지 궁금할 때가 있습니다.\n\n![이미지](/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_2.png)\n\n# 놀라운 자동 수집 정보\n\nTikTok은 넓은 데이터 수집 네트워크 덕분에 우리를 우리 자신보다 더 잘 알고 있는 것 같습니다. 앱은 이 모든 것이 경험을 맞춤화하는 데 도움이 된다고 주장하지만, 그들이 빨아들이는 데이터 양을 생각해보면 화면을 멈춰있게 만듭니다. TikTok이 가지고 있는 디지털 도시에 대한 파일을 하나씩 살펴보겠습니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n## 미션: 스파이로 로그인\n\n- IP 주소. 인터넷에서 기기의 홈 주소와 같은 작은 숫자? TikTok은 당신이 온라인에서 어디에 머무르는지 알아내기 위해 이를 사용합니다.\n- 지리 위치 데이터. 정확한 GPS 좌표를 가지고 있지 않을 수도 있지만, 인터넷 연결 덕분에 당신이 어디에 있는지에 대해 꽤 잘 알고 있습니다.\n- 고유 장치 식별자. TikTok은 장치가 가지고 있는 고유 ID로 당신의 전화를 식별할 수 있습니다. 네, 그들은 당신의 전화를 거의 당신만큼 잘 알고 있습니다.\n- 디지털 발자취. 당신이 앱에서 하는 모든 검색, 방문하는 모든 페이지 - 모두 목록에 올려져 있으며 분석할 준비가 되어 있습니다.\n- 쿠키. 이 디지털 쓰레기들은 당신의 로그인 세부정보를 기억뿐만 아니라 플랫폼에서 하는 모든 움직임을 기억합니다.\n\n## 현미경 아래에서\n\n- TikTok에서의 활동. 어떤 비디오가 당신을 웃게 만드는지, 공유할 만큼 좋아하는 비디오, 심지어 업로드를 결정하는 콘텐츠 - 모두 TikTok 매트릭스의 데이터 점입니다.\n- 기기 정보. iPhone 소유자인지 아니면 Android 사용자인지, TikTok은 메모를 하며 성능을 맞춤화하여 당신을 못 놓을 만큽 유도합니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n## 무서운 세부사항\n\n- 밤늦게 스크롤하고 타이핑하는 습관. TikTok은 당신의 휴대폰 배터리나 탭 및 스와이프 방식에 따라 당신이 잠자리에 들려고 할 때를 알아낼 수 있습니다. 그리고 네, 그들은 당신이 키보드에 실제로 입력하는 내용까지 알고 있습니다 (!)...\n- 위치, 위치, 위치. 모든 다크룸을 추적하지는 않는다고 말하지만 여전히 당신이 어디에 있는지에 맞는 콘텐츠 및 광고를 제공합니다.\n- 게시물 들여다보기. 비디오의 배경부터 음성까지, TikTok은 모든 것을 분석하고 있으며 생체 인식 데이터까지 수집할 수도 있습니다. 동의하든 말든, 조금 지나친 것 같습니다.\n\n## 디지털 탐정 작업\n\n- 메타데이터 마이닝. TikTok은 단순히 당신이 올린 것뿐만 아니라 각 콘텐츠의 어디, 언제, 어떻게를 파헤칩니다.\n- 크로스 디바이스 추적. 핸드폰에서 태블릿, 노트북으로 이동하면서? TikTok은 여러 기기를 통틀어 당신의 활동을 연결하여 디지털 생활의 상세한 초상을 그려냅니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n그게 무슨 뜻이죠? TikTok은 당신에 대한 도신자가 모아놓은 것만큼의 정보를 가지고 있을 수도 있어요. 당신의 늦은 밤 미미 세션부터 주말 여행을 담은 포스트까지, TikTok은 모든 것을 갖고 있어요. 약속은 더 개인화된 피드인 반면, 교환은 빅 브라더조차 놀라워할 정도의 감시 수준입니다. 디지털 스컬이 제게된 시대에서 TikTok은 아마, 우리가 너무 많은 것을 공유하는지에 대한 뚜렷한 알리미입니다.\n\n<img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_3.png\" />\n\n# 이 모든 데이터로 TikTok은 무엇을 할까요?\n\n그렇다면, TikTok이 우리로부터 수집한 모든 정보를 정말로 어떻게 사용할까요? 그들은 이 모든 것을 우리의 TikTok 경험을 최대한 원활하게 만드는 데 사용한다고 말해요 - 앱을 버그 없이 유지하고, 고객 지원을 제공하고, 심지어 우리의 취향에 맞게 피드에 나타나는 내용을 맞춤화합니다. 듣기에는 멋지게 들리지만, 궁금한 이웃처럼 당신이 어떤 테이크아웃을 좋아하는지 추적하고 매일 무엇을 먹을지 결정하는 것과 조금 비슷해요.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n우리 데이터를 사용하여 우리가 관심을 가질 만한 동영상을 보여주겠다고 주장합니다. 우리가 지역에서 트렌드인 것이나 이전에 시청한 것을 기반으로 추천해준다고 하네요. 우리가 좋아하는 컨텐츠를 보는 것도 멋지지만, 더 오래 화면에 묶여 있도록 하는 똑똑한 방법이기도 해요. 그리고 이 통찰력을 자기들만 가지고 있지 않고, 광고주들과 공유하고 있다고 합니다. 그래서 당신이 생각하던 스케이트보드 광고를 보게 되면 누구에게 감사를 표해야 할 지 아실 거예요.\n\nTikTok의 소셜 측면은 우리 데이터를 수집하는 이유 중 하나입니다. 관심사를 기반으로 친구와 크리에이터를 추천해주어 편리한데, 우리의 모든 행동을 추적해 온 것 같은 느낌을 줄 수도 있죠.\n\n앱과 상호작용하는 방식을 분석하여 더 나은 제안을 하고 우리의 나이나 관심사 같은 개인적인 것들까지 추측한다고 하네요. 자신을 더 잘 안다고 생각하는 친구가 있는데, 그게 바로 항상 지켜보고 있는 앱이란 점이죠.\n\nTikTok을 안전하게 유지하고 일부 기능을 위해 우리 신원을 확인하는 것은 존경스럽습니다. 그래도 안전을 위해서라면 얼마나 많은 감시에 동의하고 있는지 궁금해지지 않을 수 없네요.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n그런 다음 의사 소통이 있습니다. TikTok으로부터 업데이트 또는 콘테스트에 대한 소식을 듣는 것은 펜팔로부터 편지를 받는 것 같은 느낌을 줄 수 있습니다. 다만, 이 경우에는 귀하의 개인 정보에 지나치게 관심이 많은 펜팔입니다.\n\n마지막으로, 그들은 위치 기반 서비스를 위해 우리의 데이터를 사용하고 기술을 개선하는 방법에 대해 언급합니다. 이는 기본적으로 우리의 모든 행동을 추적하고 예측하는 능력을 섬세하게 조정하고 있다는 것을 의미합니다. 그들은 심지어 우리의 모든 데이터를 섞어서 우리가 누구인지에 대한 더 완전한 그림을 얻으려고 합니다. 우리는 거대한 실험의 일부인 것처럼 느껴지며 실험 대상이자 제품이기도 합니다.\n\n요약하면, TikTok은 모든 이 데이터 수집을 우리의 이익을 위한 서비스 및 기능으로 제시하지만, 조금은 회의적일 수 없습니다. 결국, 무료 앱의 세계에서 제품에 대한 지불을 하지 않으면, 아마 그 제품인 것이기 때문입니다.\n\n![이미지](/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_4.png)\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n# 틱톡이 내 정보를 공유하는 방법\n\n틱톡은 신뢰를 중시하고 있다고 주장하며 개인 정보를 팔거나 관련 법률에 위배되지 않는 의심스러운 광고 목적으로 전달하지 않는다고 합니다. 하지만 우리의 정보가 실제로 언제 어떻게 전파될 수 있는지 알아보도록 해볼까요?\n\n- 서비스 제공업체 및 비즈니스 파트너. 틱톡은 결제 처리, 콘테스트 정리, 광고 보내기, 앱 유지 등과 같은 이유로 여러 회사에 우리의 데이터를 제공합니다. 모든 것이 원활하게 작동하도록 하는 것이라고 말하지만, 이러한 \"운영\"에 우리 정보가 얼마나 필요한지 의심해 볼 가치가 있습니다.\n- 기업 패밀리. 글로벌 기업의 일원으로, 틱톡은 앱을 지원하기 위해 우리의 세부 정보를 자사 기업 그룹 내에서 공유합니다. 관련 회사 네트워크에서 우리 데이터가 오가는 것을 상상하게 되면 이 내부적인 공유 파티의 범위에 대해 궁금해집니다.\n- 대규모 기업 이동. 틱톡이 매각, 통합 또는 브랜드 변경이 발생하면, 우리의 데이터도 거래의 일부가 됩니다. 이를 기업 세계에서의 필수 사항으로 제시하지만, 우리 정보가 협상 탁상에 토큰으로 사용될 수 있다는 생각은 약간 불안합니다.\n- 법적 사유. 틱톡은 법률이 요구하거나 자신의 이익을 보호하기 위해 당국에게 정보를 제공해야 할 수 있습니다. 법률을 준수하는 것은 하나지만, \"이익 보호\"와 \"보안\"이라는 넓은 용어는 다양한 정당화의 여지를 남겨 두고 있습니다.\n- 당신의 승인 하에. 우리가 승인을 한다면 정보도 공유할 것입니다. 이는 합리적으로 들리지만, 세부 사항과 우리가 모르게 동의할 수 있는 방법을 고려하면 조금 더 살펴볼 필요가 있습니다.\n- 제3자와의 협력. 틱톡의 다른 플랫폼과의 파트너십은 가입 및 콘텐츠 공유를 편리하게 하기 위해 우리의 정보를 공유합니다. 편의를 위해 제공되었다고 하지만, 우리의 틱톡 행동이 다른 서비스에 전파되는 것이 조금 침범적일 수 있습니다.\n- 공개 공유. 틱톡의 공개 게시물에 발을 담그면 우리의 정보는 누구에게나 공개됩니다. 틱톡은 여기에서의 책임을 회피하며, 공유하기 전에 재고할 것을 우리에게 상기시킵니다. 이는 맞지만, 그들은 플랫폼을 용이하게 제공하면서도 책임은 완전히 우리에게 떠넘기고 있습니다.\n- 틱톡 쇼핑. 틱톡을 통해 무언가를 구매하면 구매한 세부 정보가 판매자 및 거래에 관여하는 기타 사람들과 공유됩니다. 이는 쇼핑 과정의 일부로 제시되었지만, 구매 후에 우리 정보가 어떻게 사용되는지에 대한 투명성은 여전히 불분명합니다.\n\n틱톡의 정보 공유 방식은 정보의 양 뿐 아니라, 함께 공유하는 기업 네트워크의 방대함으로 인해 눈길을 끕니다. 이들은 이를 원할한 서비스 제공의 일환으로 소개하지만, 운영에 대한 필수성과 우리의 개인정보 보호권 사이의 섬세한 균형에 있어서 의심이 듭니다. 신뢰와 안전 보장의 말로 포장되어 있더라도, 우리의 데이터가 어디로 가고 어떻게 사용되는지 항상 주의해야 함을 상기시켜줍니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n![TikTok Privacy Policy](/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_5.png)\n\n# 네, 권리와 선택권이 있어요\n\n잘했어요, 지금 틱톡의 개인정보 권리에 대한 이야기를 알아보려고 해봐요. 그들은 당신에게 아주 관대하게 당신에 대한 정보를 보거나 수정하거나 심지어 삭제할 수 있다고 말합니다. 단순히 그들의 지정된 웹페이지를 통해 연락하거나, 올드스쿨하게 느낀다면 그들의 실제 주소로 요청을 보내세요. 프로필을 업데이트하거나 틱톡 데이터를 확인하고 싶나요? 앱 설정으로 이동하세요. 또한 계정을 비활성화하거나 삭제할 수 있는 옵션이 있어요, 아마도 당신에게 통제를 주는 것과 관련이 있겠죠.\n\n당신의 개인정보에 대한 우려를 처리할 수 있는 공인 대리인이 있나요? 그들의 적법성을 증명하기 위해 막다른 상황을 겪을 준비를 해야 할 거에요. 틱톡은 이 특별한 대리인이 당신을 대신하여 보낸 증거인으로 보유권 또는 일부 견고한 서면증거를 보기를 원합니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n그들은 매우 민감한 정보(예: 금융 상세정보 또는 운전 면허 번호)를 수집한다고 우리를 달래려고 노력합니다. 이 정보는 물건을 판매하거나 신분을 확인하는 등 필수적인 용도로만 사용된다고 말이에요. 이렇게 안심시켜 주는 게 어떨까요?\n\n## 그리고 당신의 선택은?\n\n트래킹을 제한하기 위해 쿠키를 피하려고 생각 중이신가요? TikTok은 브라우저 설정을 조정하는 것을 제안하지만, 주의하세요. 각기 다른 기기와 브라우저에 대해 설정을 별도로 조정해야 한다는 점을 명심하세요. 타겟팅 광고를 거부하고 싶다면? 편리한 링크를 제공하지만, 광고주들에게 웹 사이트 주위를 따라다니지 않도록 예의 바로 말하는 것과 비슷합니다.\n\n또한 기기 설정을 조정하여 TikTok이 수집하는 정보 중 일부를 제한할 수도 있습니다. 따분한 광고 ID를 제한해 보세요. 마케팅 이메일에 싫증이 나신다면? \"구독 취소\" 옵션을 선택할 수 있는 디지털 탈출구가 항상 있습니다.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n위치 추적에 관해서 TikTok은 \"걱정하지 마세요, 미국 사용자들로부터 GPS 데이터 수집을 중단했습니다.\"라고 말합니다. 그러나 이전 버전의 앱을 사용 중이라면 GPS 데이터를 수집한 적이 있을 수 있으니, 기기에서 해당 권한을 비활성화해야 합니다.\n\n또한 브라우저의 \"추적 금지\" 신호가 모든 것을 해결해줄 것이라고 기대하면 안 됩니다. TikTok은 이 신호를 무시하고 있다는 입장입니다.\n\n요컨대, 여러분의 개인 정보를 관리할 수 있는 다양한 옵션이 제공되지만, 그 곁에는 회의론적인 분위기가 감싸고 있습니다. 권리와 선택권이 있다는 것은 좋지만, 그것들을 탐색하는 것은 이어폰 선을 풀어내는 것처럼 지루하고 조금 짜증나는 일입니다. 모든 데이터 수집이 진행되는 가운데, 이러한 권리를 행사하는 것이 바다를 작은 숟가락으로 비우려는 것과 같은 일인지 궁금해집니다.\n\n![이미지](/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_6.png)\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n# 왜 이런 것들이 걱정되는 이유?\n\n여기에 이유가 있어요:\n\n- 개인정보? TikTok 세계에 참여하면 디지털 생활 열쇠를 건네주는 셈입니다. 즐겨 찾는 카페에서의 셀카나 위치 태그는 팔로워뿐만 아니라 자상하지 못한 사람들에겐 잠재적인 금물일 수 있어요. '개인적' 정보가 사기 도시와 개인정보 침해빌을 들려다니는 세계투어를 떠날 순 없잖아요.\n- 공유는 사랑이 아닐 수 있어요. TikTok의 정보 공유 정책은 극성 댄스 챌린지보다 더 많은 정보를 전달할 수 있어요. 당신의 취향, 비호감, 밤늦은 간식 욕망도 광고주 및 누구나 당신이 계속 스크롤링하고 소비하는 온라인 세상을 맞추기 위한 자신만의 침입 구실이 될 수 있어요. 마치 눈에도 보이지 않는데 감시 당하고 있는 기분이 들지 않나요?\n- \"안전\"은 그저 말 뿐이에요. TikTok은 당신의 데이터를 보안보다 한 금고처럼 지킨다고 약속하지만, 디지털 세계에서 \"뚫리지 않는\" 보안은 실재보다는 신화에 가까워요. 데이터 유출이나 해킹 가능성은 게시물, 좋아요, 공유에 위협이 되는 칼로 드라마클레스처럼 매달려 있어요.\n- 제어? 운이 좋아라. TikTok에 게시하는 것은 디지털 바다로 병을 띄우는 메시지를 보내는 것과 같아요. 그것이 어디에 도착하고 누가 여는지 정확히 알 수 없어요. 그 순간성 스토리나 즉흥적 댓글은 당신이 이동한 뒤에도 예상치 않게 일어날 수 있어요.\n\nTikTok은 재미와 게임으로 보일 수 있지만, 개인정보와 보안 문제는 실제로 중요한 문제예요. 게임의 규칙이나 위험을 완전히 이해하지 않고 게임에 참여하는 것과 같아요. 흥미로워 보일 수 있겠지만, 당신이 예상보다 더 많은 위험에 직면할 수도 있어요.\n\n<!-- ui-station 사각형 -->\n\n<ins class=\"adsbygoogle\"\nstyle=\"display:block\"\ndata-ad-client=\"ca-pub-4877378276818686\"\ndata-ad-slot=\"7249294152\"\ndata-ad-format=\"auto\"\ndata-full-width-responsive=\"true\"></ins>\n\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n\n# 고지사항\n\n본 문서에 제공된 정보는 정보 및 교육 목적으로만 제공되며 법률 자문이나 법률 자문 대체로 사용되지 않으며 법률 자문으로 사용되어서도 안됩니다. 본 문서의 콘텐츠의 정확성과 완성도를 보증하기 위해 노력했지만, 법적 원칙과 규정은 관할권과 구체적 상황에 따라 상당히 다를 수 있음을 감안해야 합니다. 따라서 이 문서는 확정적인 법률 자료로 사용되거나 법률 결정의 근거로 사용되어서는 안됩니다. 독자는 각 개별 사례가 상세하고 개인화된 법적 분석을 필요로 할 수 있으므로 법률 문제나 사항에 대한 자문을 받기 위해 적격한 변호사와 상의하도록 권장됩니다.\n\n이 문서에 제공된 정보만을 의존하고 변호사로부터 전문 자문을 구하지 않으면 예기치 않은 법적 결과나 오해로 이어질 수 있습니다. 이 문서의 저자나 출판사는 발생 가능한 오류나 누락에 대한 책임을 지지 않으며 본 문서의 표시나 사용으로 인한 손실, 부상 또는 손해에 대해 책임을 지지 않을 것입니다. 여기 제공된 정보는 독자와 저자 또는 출판사 간의 변호사-의뢰인 관계를 생성하지 않습니다.\n","ogImage":{"url":"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_0.png"},"coverImage":"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_0.png","tag":["Tech"],"readingTime":16},"content":"<!doctype html>\n<html lang=\"en\">\n<head>\n<meta charset=\"utf-8\">\n<meta content=\"width=device-width, initial-scale=1\" name=\"viewport\">\n</head>\n<body>\n<p>최근 몇 년간 소셜 미디어는 디지털 호기심에서 수십억 명의 사람들에게 일상의 중심이 된 기초 요소로 발전해 왔습니다. Facebook, Instagram, X (이전 트위터), TikTok과 같은 플랫폼들은 의사 소통, 엔터테인먼트, 교육 (가끔), 심지어 비즈니스를 위한 주요 채널들로 성장했습니다. 이 인기 폭발적인 상승은 플랫폼이 작동하는 방식을 이해하는 것의 중요성을 보여줍니다. 특히 이용 약관과 개인정보 보호 정책에 관련하여 이해하는 것이 중요합니다.</p>\n<p>이해하는 것이 왜 중요한지 궁금하신가요? 먼저, 이용 약관은 사용자로서 당신에게 기대되는 것과 플랫폼에서 기대할 수 있는 것을 개요로 제시합니다. 더 중요한 것은 개인정보 보호 정책이 당신의 개인 정보가 어떻게 수집되고 사용되며 보호되는지를 알려줍니다. 개인 정보 보호, 보안, 데이터 누출 및 남용에 대한 우려가 커짐에 따라, 이러한 정책의 내부 사항을 알고 있다면 온라인에서 공유할 정보 및 그 정보가 사용될 수 있는 방식에 대한 균형 잡힌 결정을 내릴 수 있습니다.</p>\n<p>예를 들어, 개인 정보 보호 정책을 통해 소셜 미디어 플랫폼이 당신의 정보를 제3자에게 판매하거나 광고를 타겟하여 사용하는지, 또는 브라우징 습관에 대한 정보를 수집하는지 등을 확인할 수 있습니다. 이러한 세부 사항을 알고 있다면 프로필 설정을 조정하거나 게시물을 더 신중하게 선택하거나 어떤 플랫폼을 사용할 가치가 있는지를 결정하는 데 도움이 될 수 있습니다.</p>\n<p>대규모 사용자 기반과 영향력을 감안할 때, TikTok의 개인 정보 보호 정책을 사례 연구로 살펴보기로 결정했습니다. 우리의 목표는 데이터 수집 관행부터 동의 및 데이터 공유 정책까지 사용자들이 알아야 할 통찰을 발굴하고 강조하는 것입니다. 제 목표는 독자들이 플랫폼에서 안전하고 자신감 있게 활동할 수 있는 지식을 제공하는 데 있습니다.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p><img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_0.png\" alt=\"이미지\"></p>\n<h1>전채</h1>\n<p>이것은 틱톡의 개인 정보 보호 정책입니다 (최종 업데이트 2024년 1월 24일) - 틱톡이 여러분이 해당 앱, 웹사이트, 소프트웨어 또는 틱톡과 연결된 어떤 서비스를 사용할 때 어떻게 여러분의 개인 정보를 처리하는지 설명하는 규정서입니다. 사용하는 기기에 상관없이 적용됩니다.</p>\n<h2>이 정책은 누구에게 적용되나요?</h2>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>이 정책은 TikTok을 사용하는 누구에게나 13세 이상을 대상으로 합니다. 13세 미만인 경우에는 어린이 개인정보 보호 정책이 따로 있습니다.</p>\n<h2>TikTok은 우리에 대해 어떤 정보를 수집할까요?</h2>\n<p>TikTok은 다음과 같은 정보를 수집할 수 있습니다:</p>\n<ul>\n<li>제공하는 정보. 이는 앱 또는 웹사이트에 입력한 모든 것을 포함합니다. 예를 들어 이름, 이메일 또는 게시물 등이 있습니다.</li>\n<li>다른 사람으로부터 수집한 정보. 가끔, TikTok은 다른 사용자나 제3자 서비스와 같은 다른 곳에서 여러분에 대한 정보를 얻을 수 있습니다.</li>\n<li>자동으로 수집된 정보. TikTok은 여러분이 수동으로 입력하지 않아도 앱의 사용 방식이나 위치와 같은 여러분에 대한 일부 정보를 자동으로 수집할 수 있습니다.</li>\n</ul>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<h1>당신이 제공한 정보</h1>\n<p>틱톡 가입하려고 하는 거야? 준비해; 그렇다면 다음 정보를 공유할 수도 있어:</p>\n<ul>\n<li>기본 정보. 무심결에 시작되지만 — 이름, 나이, 사용자 이름, 비밀번호 — 예상한 것들이야. 하지만 그 후로, 이메일, 전화번호, 소셜 미디어 계정 정보를 요구할 거야. 아, 그리고 프로필 사진도 요구할 거야. 디지털 사람들 속에서 어떻게 당신을 알아볼까요?</li>\n<li>당신의 창작물. 자발적인 춤 비디오나 고양이의 캔디드 샷? 틱톡은 이것들을 모두 저장할 거야. 그리고 언제, 어디서, 그리고 어떤 필터들을 사용했는지 모조리 기억할 거야. 틱톡 사용자가 아니지만 친구의 비디오에 나왔다면? 놀랍지만, 당신도 콜렉션의 일부로 간주돼.</li>\n<li>채팅 내역. 보낸 모든 메시지? 틱톡은 이것들을 전달하는 것뿐만 아니라, 마을 소문처럼 정보들을 상세히 저장할 거야.</li>\n<li>클립보드 확인. 매운 미미나 민감한 비밀번호를 복사했냐고? 만약 틱톡을 사용 중이라면, 그것도 엿볼 수 있어.</li>\n<li>쇼핑 스토커. 틱톡 상품을 사게 됐을 때? 영수증은 그들이 갖고 있어, 말 그대로. 당신의 신용 카드 정보부터 집 주소까지, 모두 기록되어 있어.</li>\n<li>연락처 조사. 연락처를 통해 친구를 찾기로 했다고요? 틱톡은 그들만의 전화번호부처럼 당신의 전화 정보를 조사하며, 이름, 전화번호, 소셜 프로필 등 모두 훔칠 거야.</li>\n<li>본인 확인. 계정을 확인해야 한다면? 신분증을 선보일 시간이야.</li>\n<li>설문 조사. 설문이나 대회에 참여하게 되면, 그저 이기기 위한 기회뿐만 아니라 개인 정보를 더 많이 제공해야 해요. 당신의 성별, 나이부터 취미까지, 틱톡은 당신에 대한 프로필을 상세히 작성할 거야. 이것이 당신의 이력서보다도 상세할지도 몰라.</li>\n</ul>\n<p>틱톡에서 한 번의 탭, 입력, 셀카도 당신에 대해 수집하는 방대한 정보의 한 부분이 되어. 그들은 모든 것을 당신의 경험을 개선하기 위한 것이라고 약속하지만, 정말로 개인화된 것과 침입적인 것의 경계는 어디에 있는지 궁금해질 수밖에 없어. 틱톡의 데이터 제국의 광대한 체계 속에서, 우리는 사용자인가 혹은 사용되는 쪽일까?</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p><img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_1.png\" alt=\"2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_1.png\"></p>\n<h1>다른 소스로부터의 정보</h1>\n<p>틱톡은 당신이 자발적으로 그들의 앱에 놓친 것만으로 만족하지 않습니다; 그들은 당신에 대한 데이터를 어디에서든 끌어모읍니다. 마치 당신의 디지턈 DNA를 한 줄씩 조립하는 것처럼, 그리고 그들이 그렇게 하는 방법은 다음과 같습니다:</p>\n<ul>\n<li>사이드 도어를 통해. 소셜 미디어 및 다른 로그인. 편한 로그인 옵션으로 Facebook, Google 또는 Instagram을 선택했나요? 축하합니다, 당신은 방금 틱톡에 당신의 공개 프로필, 이메일 및 연락처에 대한 황금열쇠를 건넸습니다. 안전하게 보관되어 있는 것으로 여겼던 조각 정보조차 이제는 틱톡에 공개되었습니다. 갑작스럽게 당신의 별개의 온라인 생활이 더 이상 분리되어 보이지 않네요.</li>\n<li>첩자들. 광고업자들과 협력사들. 그들은 틱톡에 정보를 푸널링하는 파트너 네트워크를 보유하고 있습니다. 다른 사이트에서 클릭한 스니커즈 광고? 틱톡은 앎니다. 앱에서 한 밤의 쇼핑 열풍이 있었나요? 틱톡은 영수증을 보유하고 있습니다. 마치 당신이 한 디지턈 움직임을 카탈로그로 만들어 돌아오는 그림자가 있는 것처럼서입니다.</li>\n<li>가족관계. 계열회사들. 틱톡의 거대한 회사 그룹이 당신에 대해 알고 있다면, 그 데이터는 틱톡이 알고 있을 것입니다. 관련 앱이나 서비스를 사용했나요? 그 데이터는 틱톡으로 이동할 수 있어서 그 서버에서 당신의 프로필을 더 확실하게 만들 것입니다.</li>\n<li>입소문. 다른 사람들로부터의 정보. 비디오에서 언급된 적이 있거나 누군가가 당신의 연락처 정보를 틱톡과 공유한 적이 있나요? 그것은 허락을 받지 않아도 당신의 프로필에 추가되는 또 다른 퍼즐 조각입니다.</li>\n<li>정찰단. 외부 소스들. 틱톡의 촉수는 더 나아가서 공공 기록, 전문가 그룹 및 어디에서 어디까지든 데이터를 끌어모읍니다. 당신의 개인정보 설정이 얼마나 엄격하든 상관없습니다; 있다면, 틱톡이 그것을 캐내다가 있을 수 있습니다.</li>\n</ul>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>모든 이는 TikTok이 그들의 플랫폼에서 하는 일만을 주시하는 것이 아니라, 당신의 디지털 생활을 전반적으로 보고 있다는 것을 의미합니다. 맞춤형 콘텐츠와 광고는 멋진 트릭처럼 보일 수 있지만, 이들은 당신의 개인 정보를 희생하게 만들어 자세한 프로필로 이어지며, 디지턈 라인업에서 당신을 대신할 수도 있을 만큼 세밀합니다. TikTok은 이 모든 것이 더 나은 사용자 경험을 위한 것이라고 확신시켜 주지만, 우리가 언제 이렇게 철저하게 알려지기로 동의했는지 궁금할 때가 있습니다.</p>\n<p><img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_2.png\" alt=\"이미지\"></p>\n<h1>놀라운 자동 수집 정보</h1>\n<p>TikTok은 넓은 데이터 수집 네트워크 덕분에 우리를 우리 자신보다 더 잘 알고 있는 것 같습니다. 앱은 이 모든 것이 경험을 맞춤화하는 데 도움이 된다고 주장하지만, 그들이 빨아들이는 데이터 양을 생각해보면 화면을 멈춰있게 만듭니다. TikTok이 가지고 있는 디지털 도시에 대한 파일을 하나씩 살펴보겠습니다.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<h2>미션: 스파이로 로그인</h2>\n<ul>\n<li>IP 주소. 인터넷에서 기기의 홈 주소와 같은 작은 숫자? TikTok은 당신이 온라인에서 어디에 머무르는지 알아내기 위해 이를 사용합니다.</li>\n<li>지리 위치 데이터. 정확한 GPS 좌표를 가지고 있지 않을 수도 있지만, 인터넷 연결 덕분에 당신이 어디에 있는지에 대해 꽤 잘 알고 있습니다.</li>\n<li>고유 장치 식별자. TikTok은 장치가 가지고 있는 고유 ID로 당신의 전화를 식별할 수 있습니다. 네, 그들은 당신의 전화를 거의 당신만큼 잘 알고 있습니다.</li>\n<li>디지털 발자취. 당신이 앱에서 하는 모든 검색, 방문하는 모든 페이지 - 모두 목록에 올려져 있으며 분석할 준비가 되어 있습니다.</li>\n<li>쿠키. 이 디지털 쓰레기들은 당신의 로그인 세부정보를 기억뿐만 아니라 플랫폼에서 하는 모든 움직임을 기억합니다.</li>\n</ul>\n<h2>현미경 아래에서</h2>\n<ul>\n<li>TikTok에서의 활동. 어떤 비디오가 당신을 웃게 만드는지, 공유할 만큼 좋아하는 비디오, 심지어 업로드를 결정하는 콘텐츠 - 모두 TikTok 매트릭스의 데이터 점입니다.</li>\n<li>기기 정보. iPhone 소유자인지 아니면 Android 사용자인지, TikTok은 메모를 하며 성능을 맞춤화하여 당신을 못 놓을 만큽 유도합니다.</li>\n</ul>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<h2>무서운 세부사항</h2>\n<ul>\n<li>밤늦게 스크롤하고 타이핑하는 습관. TikTok은 당신의 휴대폰 배터리나 탭 및 스와이프 방식에 따라 당신이 잠자리에 들려고 할 때를 알아낼 수 있습니다. 그리고 네, 그들은 당신이 키보드에 실제로 입력하는 내용까지 알고 있습니다 (!)...</li>\n<li>위치, 위치, 위치. 모든 다크룸을 추적하지는 않는다고 말하지만 여전히 당신이 어디에 있는지에 맞는 콘텐츠 및 광고를 제공합니다.</li>\n<li>게시물 들여다보기. 비디오의 배경부터 음성까지, TikTok은 모든 것을 분석하고 있으며 생체 인식 데이터까지 수집할 수도 있습니다. 동의하든 말든, 조금 지나친 것 같습니다.</li>\n</ul>\n<h2>디지털 탐정 작업</h2>\n<ul>\n<li>메타데이터 마이닝. TikTok은 단순히 당신이 올린 것뿐만 아니라 각 콘텐츠의 어디, 언제, 어떻게를 파헤칩니다.</li>\n<li>크로스 디바이스 추적. 핸드폰에서 태블릿, 노트북으로 이동하면서? TikTok은 여러 기기를 통틀어 당신의 활동을 연결하여 디지털 생활의 상세한 초상을 그려냅니다.</li>\n</ul>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>그게 무슨 뜻이죠? TikTok은 당신에 대한 도신자가 모아놓은 것만큼의 정보를 가지고 있을 수도 있어요. 당신의 늦은 밤 미미 세션부터 주말 여행을 담은 포스트까지, TikTok은 모든 것을 갖고 있어요. 약속은 더 개인화된 피드인 반면, 교환은 빅 브라더조차 놀라워할 정도의 감시 수준입니다. 디지털 스컬이 제게된 시대에서 TikTok은 아마, 우리가 너무 많은 것을 공유하는지에 대한 뚜렷한 알리미입니다.</p>\n<img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_3.png\">\n<h1>이 모든 데이터로 TikTok은 무엇을 할까요?</h1>\n<p>그렇다면, TikTok이 우리로부터 수집한 모든 정보를 정말로 어떻게 사용할까요? 그들은 이 모든 것을 우리의 TikTok 경험을 최대한 원활하게 만드는 데 사용한다고 말해요 - 앱을 버그 없이 유지하고, 고객 지원을 제공하고, 심지어 우리의 취향에 맞게 피드에 나타나는 내용을 맞춤화합니다. 듣기에는 멋지게 들리지만, 궁금한 이웃처럼 당신이 어떤 테이크아웃을 좋아하는지 추적하고 매일 무엇을 먹을지 결정하는 것과 조금 비슷해요.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>우리 데이터를 사용하여 우리가 관심을 가질 만한 동영상을 보여주겠다고 주장합니다. 우리가 지역에서 트렌드인 것이나 이전에 시청한 것을 기반으로 추천해준다고 하네요. 우리가 좋아하는 컨텐츠를 보는 것도 멋지지만, 더 오래 화면에 묶여 있도록 하는 똑똑한 방법이기도 해요. 그리고 이 통찰력을 자기들만 가지고 있지 않고, 광고주들과 공유하고 있다고 합니다. 그래서 당신이 생각하던 스케이트보드 광고를 보게 되면 누구에게 감사를 표해야 할 지 아실 거예요.</p>\n<p>TikTok의 소셜 측면은 우리 데이터를 수집하는 이유 중 하나입니다. 관심사를 기반으로 친구와 크리에이터를 추천해주어 편리한데, 우리의 모든 행동을 추적해 온 것 같은 느낌을 줄 수도 있죠.</p>\n<p>앱과 상호작용하는 방식을 분석하여 더 나은 제안을 하고 우리의 나이나 관심사 같은 개인적인 것들까지 추측한다고 하네요. 자신을 더 잘 안다고 생각하는 친구가 있는데, 그게 바로 항상 지켜보고 있는 앱이란 점이죠.</p>\n<p>TikTok을 안전하게 유지하고 일부 기능을 위해 우리 신원을 확인하는 것은 존경스럽습니다. 그래도 안전을 위해서라면 얼마나 많은 감시에 동의하고 있는지 궁금해지지 않을 수 없네요.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>그런 다음 의사 소통이 있습니다. TikTok으로부터 업데이트 또는 콘테스트에 대한 소식을 듣는 것은 펜팔로부터 편지를 받는 것 같은 느낌을 줄 수 있습니다. 다만, 이 경우에는 귀하의 개인 정보에 지나치게 관심이 많은 펜팔입니다.</p>\n<p>마지막으로, 그들은 위치 기반 서비스를 위해 우리의 데이터를 사용하고 기술을 개선하는 방법에 대해 언급합니다. 이는 기본적으로 우리의 모든 행동을 추적하고 예측하는 능력을 섬세하게 조정하고 있다는 것을 의미합니다. 그들은 심지어 우리의 모든 데이터를 섞어서 우리가 누구인지에 대한 더 완전한 그림을 얻으려고 합니다. 우리는 거대한 실험의 일부인 것처럼 느껴지며 실험 대상이자 제품이기도 합니다.</p>\n<p>요약하면, TikTok은 모든 이 데이터 수집을 우리의 이익을 위한 서비스 및 기능으로 제시하지만, 조금은 회의적일 수 없습니다. 결국, 무료 앱의 세계에서 제품에 대한 지불을 하지 않으면, 아마 그 제품인 것이기 때문입니다.</p>\n<p><img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_4.png\" alt=\"이미지\"></p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<h1>틱톡이 내 정보를 공유하는 방법</h1>\n<p>틱톡은 신뢰를 중시하고 있다고 주장하며 개인 정보를 팔거나 관련 법률에 위배되지 않는 의심스러운 광고 목적으로 전달하지 않는다고 합니다. 하지만 우리의 정보가 실제로 언제 어떻게 전파될 수 있는지 알아보도록 해볼까요?</p>\n<ul>\n<li>서비스 제공업체 및 비즈니스 파트너. 틱톡은 결제 처리, 콘테스트 정리, 광고 보내기, 앱 유지 등과 같은 이유로 여러 회사에 우리의 데이터를 제공합니다. 모든 것이 원활하게 작동하도록 하는 것이라고 말하지만, 이러한 \"운영\"에 우리 정보가 얼마나 필요한지 의심해 볼 가치가 있습니다.</li>\n<li>기업 패밀리. 글로벌 기업의 일원으로, 틱톡은 앱을 지원하기 위해 우리의 세부 정보를 자사 기업 그룹 내에서 공유합니다. 관련 회사 네트워크에서 우리 데이터가 오가는 것을 상상하게 되면 이 내부적인 공유 파티의 범위에 대해 궁금해집니다.</li>\n<li>대규모 기업 이동. 틱톡이 매각, 통합 또는 브랜드 변경이 발생하면, 우리의 데이터도 거래의 일부가 됩니다. 이를 기업 세계에서의 필수 사항으로 제시하지만, 우리 정보가 협상 탁상에 토큰으로 사용될 수 있다는 생각은 약간 불안합니다.</li>\n<li>법적 사유. 틱톡은 법률이 요구하거나 자신의 이익을 보호하기 위해 당국에게 정보를 제공해야 할 수 있습니다. 법률을 준수하는 것은 하나지만, \"이익 보호\"와 \"보안\"이라는 넓은 용어는 다양한 정당화의 여지를 남겨 두고 있습니다.</li>\n<li>당신의 승인 하에. 우리가 승인을 한다면 정보도 공유할 것입니다. 이는 합리적으로 들리지만, 세부 사항과 우리가 모르게 동의할 수 있는 방법을 고려하면 조금 더 살펴볼 필요가 있습니다.</li>\n<li>제3자와의 협력. 틱톡의 다른 플랫폼과의 파트너십은 가입 및 콘텐츠 공유를 편리하게 하기 위해 우리의 정보를 공유합니다. 편의를 위해 제공되었다고 하지만, 우리의 틱톡 행동이 다른 서비스에 전파되는 것이 조금 침범적일 수 있습니다.</li>\n<li>공개 공유. 틱톡의 공개 게시물에 발을 담그면 우리의 정보는 누구에게나 공개됩니다. 틱톡은 여기에서의 책임을 회피하며, 공유하기 전에 재고할 것을 우리에게 상기시킵니다. 이는 맞지만, 그들은 플랫폼을 용이하게 제공하면서도 책임은 완전히 우리에게 떠넘기고 있습니다.</li>\n<li>틱톡 쇼핑. 틱톡을 통해 무언가를 구매하면 구매한 세부 정보가 판매자 및 거래에 관여하는 기타 사람들과 공유됩니다. 이는 쇼핑 과정의 일부로 제시되었지만, 구매 후에 우리 정보가 어떻게 사용되는지에 대한 투명성은 여전히 불분명합니다.</li>\n</ul>\n<p>틱톡의 정보 공유 방식은 정보의 양 뿐 아니라, 함께 공유하는 기업 네트워크의 방대함으로 인해 눈길을 끕니다. 이들은 이를 원할한 서비스 제공의 일환으로 소개하지만, 운영에 대한 필수성과 우리의 개인정보 보호권 사이의 섬세한 균형에 있어서 의심이 듭니다. 신뢰와 안전 보장의 말로 포장되어 있더라도, 우리의 데이터가 어디로 가고 어떻게 사용되는지 항상 주의해야 함을 상기시켜줍니다.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p><img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_5.png\" alt=\"TikTok Privacy Policy\"></p>\n<h1>네, 권리와 선택권이 있어요</h1>\n<p>잘했어요, 지금 틱톡의 개인정보 권리에 대한 이야기를 알아보려고 해봐요. 그들은 당신에게 아주 관대하게 당신에 대한 정보를 보거나 수정하거나 심지어 삭제할 수 있다고 말합니다. 단순히 그들의 지정된 웹페이지를 통해 연락하거나, 올드스쿨하게 느낀다면 그들의 실제 주소로 요청을 보내세요. 프로필을 업데이트하거나 틱톡 데이터를 확인하고 싶나요? 앱 설정으로 이동하세요. 또한 계정을 비활성화하거나 삭제할 수 있는 옵션이 있어요, 아마도 당신에게 통제를 주는 것과 관련이 있겠죠.</p>\n<p>당신의 개인정보에 대한 우려를 처리할 수 있는 공인 대리인이 있나요? 그들의 적법성을 증명하기 위해 막다른 상황을 겪을 준비를 해야 할 거에요. 틱톡은 이 특별한 대리인이 당신을 대신하여 보낸 증거인으로 보유권 또는 일부 견고한 서면증거를 보기를 원합니다.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>그들은 매우 민감한 정보(예: 금융 상세정보 또는 운전 면허 번호)를 수집한다고 우리를 달래려고 노력합니다. 이 정보는 물건을 판매하거나 신분을 확인하는 등 필수적인 용도로만 사용된다고 말이에요. 이렇게 안심시켜 주는 게 어떨까요?</p>\n<h2>그리고 당신의 선택은?</h2>\n<p>트래킹을 제한하기 위해 쿠키를 피하려고 생각 중이신가요? TikTok은 브라우저 설정을 조정하는 것을 제안하지만, 주의하세요. 각기 다른 기기와 브라우저에 대해 설정을 별도로 조정해야 한다는 점을 명심하세요. 타겟팅 광고를 거부하고 싶다면? 편리한 링크를 제공하지만, 광고주들에게 웹 사이트 주위를 따라다니지 않도록 예의 바로 말하는 것과 비슷합니다.</p>\n<p>또한 기기 설정을 조정하여 TikTok이 수집하는 정보 중 일부를 제한할 수도 있습니다. 따분한 광고 ID를 제한해 보세요. 마케팅 이메일에 싫증이 나신다면? \"구독 취소\" 옵션을 선택할 수 있는 디지털 탈출구가 항상 있습니다.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<p>위치 추적에 관해서 TikTok은 \"걱정하지 마세요, 미국 사용자들로부터 GPS 데이터 수집을 중단했습니다.\"라고 말합니다. 그러나 이전 버전의 앱을 사용 중이라면 GPS 데이터를 수집한 적이 있을 수 있으니, 기기에서 해당 권한을 비활성화해야 합니다.</p>\n<p>또한 브라우저의 \"추적 금지\" 신호가 모든 것을 해결해줄 것이라고 기대하면 안 됩니다. TikTok은 이 신호를 무시하고 있다는 입장입니다.</p>\n<p>요컨대, 여러분의 개인 정보를 관리할 수 있는 다양한 옵션이 제공되지만, 그 곁에는 회의론적인 분위기가 감싸고 있습니다. 권리와 선택권이 있다는 것은 좋지만, 그것들을 탐색하는 것은 이어폰 선을 풀어내는 것처럼 지루하고 조금 짜증나는 일입니다. 모든 데이터 수집이 진행되는 가운데, 이러한 권리를 행사하는 것이 바다를 작은 숟가락으로 비우려는 것과 같은 일인지 궁금해집니다.</p>\n<p><img src=\"/assets/img/2024-05-20-TikToksPrivacyPolicySneakyGlanceintoYourDigitalDiary_6.png\" alt=\"이미지\"></p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<h1>왜 이런 것들이 걱정되는 이유?</h1>\n<p>여기에 이유가 있어요:</p>\n<ul>\n<li>개인정보? TikTok 세계에 참여하면 디지털 생활 열쇠를 건네주는 셈입니다. 즐겨 찾는 카페에서의 셀카나 위치 태그는 팔로워뿐만 아니라 자상하지 못한 사람들에겐 잠재적인 금물일 수 있어요. '개인적' 정보가 사기 도시와 개인정보 침해빌을 들려다니는 세계투어를 떠날 순 없잖아요.</li>\n<li>공유는 사랑이 아닐 수 있어요. TikTok의 정보 공유 정책은 극성 댄스 챌린지보다 더 많은 정보를 전달할 수 있어요. 당신의 취향, 비호감, 밤늦은 간식 욕망도 광고주 및 누구나 당신이 계속 스크롤링하고 소비하는 온라인 세상을 맞추기 위한 자신만의 침입 구실이 될 수 있어요. 마치 눈에도 보이지 않는데 감시 당하고 있는 기분이 들지 않나요?</li>\n<li>\"안전\"은 그저 말 뿐이에요. TikTok은 당신의 데이터를 보안보다 한 금고처럼 지킨다고 약속하지만, 디지털 세계에서 \"뚫리지 않는\" 보안은 실재보다는 신화에 가까워요. 데이터 유출이나 해킹 가능성은 게시물, 좋아요, 공유에 위협이 되는 칼로 드라마클레스처럼 매달려 있어요.</li>\n<li>제어? 운이 좋아라. TikTok에 게시하는 것은 디지털 바다로 병을 띄우는 메시지를 보내는 것과 같아요. 그것이 어디에 도착하고 누가 여는지 정확히 알 수 없어요. 그 순간성 스토리나 즉흥적 댓글은 당신이 이동한 뒤에도 예상치 않게 일어날 수 있어요.</li>\n</ul>\n<p>TikTok은 재미와 게임으로 보일 수 있지만, 개인정보와 보안 문제는 실제로 중요한 문제예요. 게임의 규칙이나 위험을 완전히 이해하지 않고 게임에 참여하는 것과 같아요. 흥미로워 보일 수 있겠지만, 당신이 예상보다 더 많은 위험에 직면할 수도 있어요.</p>\n<!-- ui-station 사각형 -->\n<p><ins class=\"adsbygoogle\" style=\"display:block\" data-ad-client=\"ca-pub-4877378276818686\" data-ad-slot=\"7249294152\" data-ad-format=\"auto\" data-full-width-responsive=\"true\"></ins></p>\n<script>\n(adsbygoogle = window.adsbygoogle || []).push({});\n</script>\n<h1>고지사항</h1>\n<p>본 문서에 제공된 정보는 정보 및 교육 목적으로만 제공되며 법률 자문이나 법률 자문 대체로 사용되지 않으며 법률 자문으로 사용되어서도 안됩니다. 본 문서의 콘텐츠의 정확성과 완성도를 보증하기 위해 노력했지만, 법적 원칙과 규정은 관할권과 구체적 상황에 따라 상당히 다를 수 있음을 감안해야 합니다. 따라서 이 문서는 확정적인 법률 자료로 사용되거나 법률 결정의 근거로 사용되어서는 안됩니다. 독자는 각 개별 사례가 상세하고 개인화된 법적 분석을 필요로 할 수 있으므로 법률 문제나 사항에 대한 자문을 받기 위해 적격한 변호사와 상의하도록 권장됩니다.</p>\n<p>이 문서에 제공된 정보만을 의존하고 변호사로부터 전문 자문을 구하지 않으면 예기치 않은 법적 결과나 오해로 이어질 수 있습니다. 이 문서의 저자나 출판사는 발생 가능한 오류나 누락에 대한 책임을 지지 않으며 본 문서의 표시나 사용으로 인한 손실, 부상 또는 손해에 대해 책임을 지지 않을 것입니다. 여기 제공된 정보는 독자와 저자 또는 출판사 간의 변호사-의뢰인 관계를 생성하지 않습니다.</p>\n</body>\n</html>\n"},"__N_SSG":true}